{
  "0cd3c890": {
    "id": "0cd3c890",
    "filename": "mcdonalds_ingredientslist.pdf",
    "original_filename": "mcdonalds_ingredientslist.pdf",
    "file_type": "application/pdf",
    "file_size": 78037,
    "file_path": "C:\\Users\\Youssef\\Downloads\\bot\\Multi-Organization-Chatbot-System\\backend\\shared_uploads\\0cd3c890_mcdonalds_ingredientslist.pdf",
    "processed": true,
    "chunk_count": 142,
    "content_preview": "Provided below is a listing of components in our popular menu items by category, followed by the ingredient statements for those components. Allergens contained\nwithin these components are indicated i",
    "extracted_text": "Provided below is a listing of components in our popular menu items by category, followed by the ingredient statements for those components. Allergens contained\nwithin these components are indicated in capital type at the end of each respective ingredient statement. We encourage customers to check these statements\nregularly as ingredients in menu items may change.\nBurgers & Sandwiches\nBig Mac: \n100% BEEF PATTY, BIG MAC BUN, PASTEURIZED PROCESS AMERICAN CHEESE, BIG MAC SAUCE, SHREDDED LETTUCE, PICKLE SLICES, ONIONS\nQuarter Pounder® with Cheese+: \nQUARTER POUND 100% BEEF PATTY*, SESAME SEED BUN, PASTEURIZED PROCESS AMERICAN CHEESE, KETCHUP, MUSTARD, PICKLE SLICES,\nSLIVERED ONIONS\nQuarter Pounder Bacon Habanero Ranch+: \nQUARTER POUND 100% BEEF PATTY*, BAKERY STYLE BUN, TOMATO SLICE, THICK CUT APPLEWOOD SMOKED BACON, PASTEURIZED PROCESS\nWHITE CHEDDAR CHEESE, HABANERO RANCH SAUCE, LEAF LETTUCE\nQuarter Pounder Bacon & Cheese+: \nQUARTER POUND 100% BEEF PATTY*, BAKERY STYLE BUN, THICK CUT APPLEWOOD SMOKED BACON, KETCHUP, PASTEURIZED PROCESS\nAMERICAN CHEESE, CRINKLE CUT PICKLES, RED ONIONS, MUSTARD\nQuarter Pounder Deluxe+: \nQUARTER POUND 100% BEEF PATTY*, BAKERY STYLE BUN, TOMATO SLICE, MAYONNAISE DRESSING, PASTEURIZED PROCESS AMERICAN CHEESE,\nCRINKLE CUT PICKLES, RED ONIONS, LEAF LETTUCE, MUSTARD\nDouble Quarter Pounder with Cheese++: \nQUARTER POUND 100% BEEF PATTY*, SESAME SEED BUN, PASTEURIZED PROCESS AMERICAN CHEESE, KETCHUP, MUSTARD, PICKLE SLICES,\nSLIVERED ONIONS\nHamburger: \n100% BEEF PATTY, REGULAR BUN, KETCHUP, MUSTARD, PICKLE SLICES, ONIONS\nCheeseburger: \n100% BEEF PATTY, REGULAR BUN, PASTEURIZED PROCESS AMERICAN CHEESE, KETCHUP, MUSTARD, PICKLE SLICES, ONIONS\nBBQ Ranch Burger: \nREGULAR BUN, 100% BEEF PATTY, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE, BBQ RANCH SAUCE, CHILI LIME TORTILLA STRIPS\nGrilled Onion Cheddar: \nREGULAR BUN, 100% BEEF PATTY, CARAMELIZED ONIONS, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE\nDouble Cheeseburger: \n100% BEEF PATTY, REGULAR BUN, PASTEURIZED PROCESS AMERICAN CHEESE, KETCHUP, MUSTARD, PICKLE SLICES, ONIONS\nMcDouble: \n100% BEEF PATTY, REGULAR BUN, PASTEURIZED PROCESS AMERICAN CHEESE, KETCHUP, PICKLE SLICES, ONIONS, MUSTARD\nBacon McDouble: \n100% BEEF PATTY, REGULAR BUN, PASTEURIZED PROCESS AMERICAN CHEESE, THICK CUT APPLEWOOD SMOKED BACON, KETCHUP, PICKLE\nSLICES, ONIONS, MUSTARD\nDaily Double†: \n100% BEEF PATTY, REGULAR BUN, TOMATO SLICE, PASTEURIZED PROCESS AMERICAN CHEESE, MAYONNAISE DRESSING, SHREDDED LETTUCE,\nSLIVERED ONIONS\nPremium Crispy Chicken Classic Sandwich: \nCRISPY CHICKEN FILLET, BAKERY STYLE BUN, TOMATO SLICE, MAYONNAISE DRESSING, LEAF LETTUCE\nPremium Grilled Chicken Classic Sandwich: \nGRILLED CHICKEN FILLET, BAKERY STYLE BUN, MAYONNAISE DRESSING, LEAF LETTUCE, TOMATO SLICE\nPremium Crispy Chicken Club Sandwich: \nCRISPY CHICKEN FILLET, BAKERY STYLE BUN, TOMATO SLICE, THICK CUT APPLEWOOD SMOKED BACON, SWISS CHEESE, MAYONNAISE DRESSING,\nLEAF LETTUCE\nPremium Grilled Chicken Club Sandwich: \nBAKERY STYLE BUN, GRILLED CHICKEN FILLET, TOMATO SLICE, THICK CUT APPLEWOOD SMOKED BACON, SWISS CHEESE, MAYONNAISE DRESSING,\nLEAF LETTUCE\nPremium Crispy Chicken Ranch BLT Sandwich: \nCRISPY CHICKEN FILLET, BAKERY STYLE BUN, TOMATO SLICE, THICK CUT APPLEWOOD SMOKED BACON, BUTTERMILK RANCH SAUCE, LEAF\nLETTUCE\n McDonald's USA Ingredients Listing for Popular Menu Items\nPremium Grilled Chicken Ranch BLT Sandwich: \nGRILLED CHICKEN FILLET, BAKERY STYLE BUN, TOMATO SLICE, THICK CUT APPLEWOOD SMOKED BACON, BUTTERMILK RANCH SAUCE, LEAF\nLETTUCE\nMcChicken ®: \nMCCHICKEN PATTY, REGULAR BUN, MAYONNAISE DRESSING, SHREDDED LETTUCE\nBuffalo Ranch McChicken: \nMCCHICKEN PATTY, REGULAR BUN, SHREDDED LETTUCE, SPICY BUFFALO SAUCE, BUTTERMILK RANCH SAUCE\nBacon Buffalo Ranch McChicken: \nMCCHICKEN PATTY, REGULAR BUN, SHREDDED LETTUCE, THICK CUT APPLEWOOD SMOKED BACON, SPICY BUFFALO SAUCE, BUTTERMILK RANCH\nSAUCE\nBacon Cheddar McChicken: \nMCCHICKEN PATTY, REGULAR BUN, MAYONNAISE DRESSING, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE, SHREDDED LETTUCE, THICK CUT\nAPPLEWOOD SMOKED BACON\nSouthern Style Crispy Chicken Sandwich: \nCRISPY CHICKEN FILLET, REGULAR BUN, PICKLE SLICES, LIQUID MARGARINE\nFilet-O-Fish: \nFISH FILET PATTY, REGULAR BUN, TARTAR SAUCE, PASTEURIZED PROCESS AMERICAN CHEESE\nMcRib ®†: \nMCRIB PORK PATTY, MCRIB BUN, MCRIB SAUCE, PICKLE SLICES, SLIVERED ONIONS\nPremium McWrap Southwest Chicken (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, TOMATO SLICE, SHREDDED LETTUCE, CILANTRO LIME GLAZE, HABANERO RANCH SAUCE, SHREDDED\nCHEDDAR/JACK CHEESE, SPRING MIX, CHILI LIME TORTILLA STRIPS\nPremium McWrap Southwest Chicken (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, TOMATO SLICE, SHREDDED LETTUCE, CILANTRO LIME GLAZE, HABANERO RANCH SAUCE, SHREDDED\nCHEDDAR/JACK CHEESE, SPRING MIX, CHILI LIME TORTILLA STRIPS\nPremium McWrap Chicken & Bacon (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, TOMATO SLICE, SHREDDED CHEDDAR/JACK CHEESE, SPRING MIX, CREAMY\nGARLIC SAUCE, THICK CUT APPLEWOOD SMOKED BACON\nPremium McWrap Chicken & Bacon (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, TOMATO SLICE, SHREDDED CHEDDAR/JACK CHEESE, SPRING MIX, THICK CUT\nAPPLEWOOD SMOKED BACON, CREAMY GARLIC SAUCE\nPremium McWrap Chicken & Ranch (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, CUCUMBER, TOMATO SLICE, SHREDDED CHEDDAR/JACK CHEESE, SPRING MIX,\nBUTTERMILK RANCH SAUCE, SEASONED RICE VINEGAR\nPremium McWrap Chicken & Ranch (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, CUCUMBER, TOMATO SLICE, SHREDDED CHEDDAR/JACK CHEESE, SPRING MIX,\nBUTTERMILK RANCH SAUCE, SEASONED RICE VINEGAR\nPremium McWrap Chicken Sweet Chili (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, CUCUMBER, SWEET CHILI SAUCE, SPRING MIX, CREAMY GARLIC SAUCE\nPremium McWrap Chicken Sweet Chili (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, CUCUMBER, SWEET CHILI SAUCE, SPRING MIX, CREAMY GARLIC SAUCE\nChipotle BBQ Snack Wrap (Crispy): \nFLOUR TORTILLA, CRISPY CHICKEN FILLET, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, CHIPOTLE BBQ SAUCE\nChipotle BBQ Snack Wrap (Grilled): \nFLOUR TORTILLA, GRILLED CHICKEN FILLET, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, CHIPOTLE BBQ SAUCE\nHoney Mustard Snack Wrap (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, TANGY HONEY MUSTARD SAUCE\nHoney Mustard Snack Wrap (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, TANGY HONEY MUSTARD SAUCE\nRanch Snack Wrap® (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, BUTTERMILK RANCH SAUCE, SHREDDED LETTUCE\nRanch Snack Wrap® (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, BUTTERMILK RANCH SAUCE\nMac Snack Wrap†: \n1/2 QUARTER POUND 100% BEEF PATTY*, FLOUR TORTILLA, SHREDDED LETTUCE, BIG MAC SAUCE, PICKLE SLICES, PASTEURIZED PROCESS\nAMERICAN CHEESE, ONIONS\n1/2 QUARTER POUND 100% BEEF PATTY*: \nIngredients: 100% Pure USDA Inspected Beef; No Fillers, No Extenders.\nPrepared With Grill Seasoning (Salt, Black Pepper).\n*Based On The Weight Before Cooking 4 Oz. (113.4g)\n100% BEEF PATTY: \nIngredients: 100% Pure USDA Inspected Beef; No Fillers, No Extenders.\nPrepared with Grill Seasoning (Salt, Black Pepper).\nBAKERY STYLE BUN: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, Whole Wheat\nFlour, High Fructose Corn Syrup, Honey, Wheat Gluten, Contains 2% or Less of: Yeast, Soybean Oil, Maltodextrin (Dietary Fiber), Salt, Calcium Sulfate, Dough\nConditioners (Wheat Flour, DATEM, Ascorbic Acid, Azodicarbonamide, Sodium Stearoyl Lactylate, Mono and Diglycerides, Enzymes, Calcium Peroxide), Ammonium\nSulfate, Natural Flavor (Botanical Source), Calcium Propionate (Preservative), Vitamin D3, Rolled Wheat (Topping). \nCONTAINS: WHEAT. \nBBQ RANCH SAUCE: \nIngredients: Water, Soybean Oil, Cultured Buttermilk, Sugar, Distilled Vinegar, Tomato Paste, Egg Yolks, Spices, Fire Roasted Jalapeno Pepper Puree, Salt,\nButtermilk Powder, Natural Flavors (Plant and Animal Source), Orange Juice Concentrate Powder, Worcestershire Sauce (Distilled Vinegar, Molasses, Corn Syrup,\nWater, Salt, Caramel Color, Garlic Powder, Sugar, Spices, Tamarind, Natural Flavor [Plant Source]), Maltodextrin, Garlic Powder, Onion Powder, Xanthan Gum,\nLemon Juice Concentrate, Lime Juice Concentrate Powder, Dehydrated Green Bell Pepper Powder, Tomato Powder, Natural Hickory Smoke Flavor (Plant Source),\nCitric Acid, Lactic Acid, Dehydrated Parsley, Dehydrated Onion, Modified Corn Starch. \nCONTAINS: MILK, EGG AND WHEAT. \nBUTTERMILK RANCH SAUCE: \nIngredients:  Soybean Oil, Cultured Buttermilk, Water, Sour Cream (Milk, Cultured Cream, Modified Food Starch, Guar Gum, Sodium Phosphates, Carob Bean Gum,\nSodium Citrate, Calcium Sulfate, Carrageenan, Dextrose, Potassium Sorbate, Citric Acid, Gelatin, Mono- and Diglycerides), Egg Yolks, Contains 2% or Less: Distilled\nVinegar, Maltodextrin, Salt, Dextrose, Modified Food Starch, Soy Sauce (Soybeans, Wheat, Salt), Dried Onion, Garlic Powder, Lactic Acid, Natural (Plant and Dairy\nSources) and Artificial Flavors, Shallots, Preservatives (Sodium Benzoate, Potassium Sorbate, Calcium Disodium EDTA), Xanthan Gum, Spice, Phosphoric Acid,\nSodium Acid Sulfate, Propylene Glycol Alginate, Autolyzed Yeast Extract. \nCONTAINS: MILK, EGG, SOY, WHEAT. \nBig Mac\u0000 Bun: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, High Fructose\nCorn Syrup and/or Sugar, Yeast, Soybean Oil and/or Canola Oil, Contains 2% or Less: Salt, Wheat Gluten, Calcium Sulfate, Calcium Carbonate, Ammonium Sulfate,\nAmmonium Chloride, Dough Conditioners (May Contain One or More of: Sodium Stearoyl Lactylate, DATEM, Ascorbic Acid, Azodicarbonamide, Mono and\nDiglycerides, Ethoxylated Monoglycerides, Monocalcium Phosphate, Enzymes, Guar Gum, Calcium Peroxide), Sorbic Acid, Calcium Propionate and/or Sodium\nPropionate (Preservatives), Soy Lecithin, Sesame Seed. \nCONTAINS: WHEAT AND SOY LECITHIN. \nBig Mac\u0000 Sauce: \nIngredients: Soybean Oil, Pickle Relish (Diced Pickles, High Fructose Corn Syrup, Sugar, Vinegar, Corn Syrup, Salt, Calcium Chloride, Xanthan Gum, Potassium\nSorbate [Preservative], Spice Extractives, Polysorbate 80), Distilled Vinegar, Water, Egg Yolks, High Fructose Corn Syrup, Onion Powder, Mustard Seed, Salt,\nSpices, Propylene Glycol Alginate, Sodium Benzoate (Preservative), Mustard Bran, Sugar, Garlic Powder, Vegetable Protein (Hydrolyzed Corn, Soy and Wheat),\nCaramel Color, Extractives of Paprika, Soy Lecithin, Turmeric (Color), Calcium Disodium EDTA (Protect Flavor). \nCONTAINS: WHEAT, EGG AND SOY. \nCARAMELIZED ONIONS: \nIngredients: Slivered Onions Prepared in Onion Reduction Sauce (Palm, Soybean and/or Cottonseed Oil, Salt, Sugar, Caramelized Sugar, Onion Powder,\nMaltodextrin, Natural Flavors [Plant Source], Spice).\nCHILI LIME TORTILLA STRIPS: \nIngredients:  Corn, Vegetable Oil (Corn, Soybean and Sunflower Oil), Salt, Maltodextrin, Sugar, Dried Tomato, Dextrose, Spices, Onion Powder, Green Bell Pepper\nPowder, Citric Acid, Autolyzed Yeast Extract, Malic Acid, Paprika Extract (Color), Disodium Inosinate, Disodium Guanylate, Natural Flavor (Plant Source), Lemon\nExtract, Spice Extractive.\nCHIPOTLE BBQ SAUCE: \nIngredients: High Fructose Corn Syrup, Water, Tomato Paste, Honey, Distilled Vinegar, Molasses, Modified Food Starch, Natural (Plant Source) and Artificial Flavors,\nSalt, Dried Chipotle Peppers, Natural Smoke Flavor (Plant Source), Dried Chili Peppers, Soybean Oil, Sodium Benzoate and Potassium Sorbate (Preservatives),\nOnion Powder, Garlic Powder, Caramel Color, Propylene Glycol Alginate, Spice.\nCILANTRO LIME GLAZE: \nIngredients: Water, Corn Syrup Solids, High Fructose Corn Syrup, Sugar, Distilled Vinegar, Olive Oil, Soybean Oil, Freeze-Dried Orange Juice Concentrate, Cilantro,\nSalt, Freeze-Dried Lime Juice Concentrate, Xanthan Gum, Sodium Benzoate and Potassium Sorbate (Preservatives), Garlic Powder, Propylene Glycol Alginate,\nSpice, Onion Powder, Citric Acid.\nCREAMY GARLIC SAUCE: \nIngredients: Yogurt (Cultured Nonfat Milk, Modified Food Starch, Gelatin, Pectin), Water, Soybean Oil, Distilled Vinegar, Whey Protein Concentrate, Egg Yolks,\nRoasted Garlic (Garlic Puree, Evaporated Cane Syrup), Sugar, Modified Food Starch, Rice Vinegar, Salt, Xanthan Gum, Propylene Glycol Alginate, Potassium\nSorbate and Sodium Benzoate (Preservatives), Sodium Acid Sulfate, Natural Flavor (Plant Source), Calcium Disodium EDTA (Protect Flavor). \nCONTAINS: EGG AND MILK. \nCRINKLE CUT PICKLES: \nIngredients:  Cucumbers, Water, Distilled Vinegar, Salt, Calcium Chloride, Sodium Benzoate (Preservative), Natural Flavors (Plant Source), Polysorbate 80,\nExtractives of Turmeric (Color). \nCRISPY CHICKEN FILLET: \nIngredients: Chicken Breast Fillet with Rib Meat, Water, Seasoning (Sugar, Salt, Sodium Phosphates, Modified Tapioca Starch, Spice, Autolyzed Yeast Extract,\nCarrageenan, Natural [Vegetable and Botanical Source] and Artificial Flavors, Maltodextrin, Sunflower Lecithin, Gum Arabic). Battered and Breaded with: Bleached\nWheat Flour, Water, Wheat Flour, Sugar, Salt, Modified Food Starch, Yellow Corn Flour, Leavening (Sodium Acid Pyrophosphate, Baking Soda, Sodium Aluminum\nPhosphate, Monocalcium Phosphate, Ammonium Bicarbonate), Wheat Gluten, Spices, Corn Starch, Dextrose, Xanthan Gum, Extractives of Paprika. \nCONTAINS: WHEAT. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness).\nDimethylpolysiloxane added as an antifoaming agent.\nCUCUMBER: \nIngredients: Cucumber\nFISH FILET PATTY: \nIngredients: Pollock, Wheat Flour, Water, Modified Food Starch, Contains 2% or Less: Yellow Corn Flour, Bleached Wheat Flour, Salt, Whey, Dextrose, Dried Yeast,\nSugar, Cellulose Gum, Colored with Paprika and Turmeric Extract, Spice Extractives. \nCONTAINS: FISH (POLLOCK), WHEAT AND MILK. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid Added to Preserve Freshness).\nDimethylpolysiloxane Added as an Antifoaming Agent.\nFLOUR TORTILLA: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, Shortening\n(Interesterified Soybean Oil and/or Hydrogenated Soybean Oil and/or Soybean Oil and/or Hydrogenated Cottonseed Oil), Contains 2% or Less of: Sugar, Leavening\n(May Contain One or More of: Baking Soda, Sodium Aluminum Sulfate, Corn Starch, Sodium Acid Pyrophosphate, Calcium Sulfate, Monocalcium Phosphate), Salt,\nWheat Gluten, Dough Conditioners (Sodium Metabisulfite [Contains Sulfites], Distilled Monoglycerides). \nCONTAINS: WHEAT. \nGRILLED CHICKEN FILLET: \nIngredients: Chicken Breast Fillet with Rib Meat, Water, Seasoning (Rice Starch, Salt, Sugar, Yeast Extract, Canola Oil, Onion Powder, Maltodextrin, Chicken Skin,\nPaprika, Flavor, Sunflower Oil, Chicken, Garlic Powder, Chicken Fat, Spices), Sodium Phosphates.\n \nPrepared with Liquid Margarine: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin,\nMono-and Diglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN\nPrepared with Liquid Margarine: Liquid soybean oil and hydrogenated cottonseed and soybean oils, water, partially hydrogenated soybean oil, salt, soy\nlecithin, mono-and diglycerides, sodium benzoate and potassium sorbate (preservatives), artificial flavor, citric acid, vitamin A palmitate, beta carotene\n(color). \n \nCONTAINS: SOY LECITHIN. \nHABANERO RANCH SAUCE: \nIngredients: Water, Soybean Oil, Corn Syrup Solids, Distilled Vinegar, Buttermilk Powder, Egg Yolks, Maltodextrin, Dried Cayenne Red Pepper Sauce (Aged\nCayenne Red Peppers, Vinegar, Salt, Garlic), Sugar, Corn Starch, Modified Food Starch, Contains 1% or Less:  Salt, Spice and Spice Extractives, Natural Flavor\n(Dairy and Animal Sources), Lemon Juice Concentrate, Lactic Acid, Habanero Pepper, Red Bell Pepper Powder, Sodium Benzoate and Potassium Sorbate\n(Preservatives), Xanthan Gum, Propylene Glycol Alginate, Apple Cider Vinegar. \nCONTAINS: MILK, EGG. \nKETCHUP: \nIngredients: Tomato Concentrate from Red Ripe Tomatoes, Distilled Vinegar, High Fructose Corn Syrup, Corn Syrup, Water, Salt, Natural Flavors (Plant Source).\nLEAF LETTUCE:\nLIQUID MARGARINE: \nIngredients: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin, Mono and\nDiglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN. \nMAYONNAISE DRESSING: \nIngredients: Water, Soybean Oil, Distilled Vinegar, Maltodextrin, Modified Food Starch, Enzyme Modified Egg Yolk, Salt, Sugar, Xanthan Gum, Mustard Flour,\nPotassium Sorbate (Preservative), Lemon Juice Concentrate, Polysorbate 80, Natural Flavor (Animal Source), Calcium Disodium EDTA to Protect Flavor, Beta\nCarotene (Color). \nCONTAINS: EGG. \nMCRIB BUN: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, Yeast, High\nFructose Corn Syrup, Contains 2% Or Less: Salt, Corn Meal, Wheat Gluten, Soybean Oil, Partially Hydrogenated Soybean and/or Cottonseed Oils, Dextrose, Sugar,\nMalted Barley Flour, Cultured Wheat Flour, Calcium Sulfate, Ammonium Sulfate, Soy Flour, Dough Conditioners (Sodium Stearoyl Lactylate, DATEM, Ascorbic Acid,\nAzodicarbonamide, Mono- and Diglycerides, Ethoxylated Mono- and Diglycerides, Monocalcium Phosphate, Enzymes, Guar Gum, Calcium Peroxide), Calcium\nPropionate (Preservative), Soy Lecithin. \nCONTAINS: WHEAT AND SOY. \nMCRIB PORK PATTY: \nIngredients: Pork, Water, Salt, Dextrose, Preservatives (BHA, Propyl Gallate, Citric Acid).\nMCRIB SAUCE: \nIngredients:  Water, High Fructose Corn Syrup, Tomato Paste, Distilled Vinegar, Molasses, Natural Smoke Flavor (Plant Source), Modified Food Starch, Salt, Sugar,\nSpices, Soybean Oil, Xanthan Gum, Onion Powder, Garlic Powder, Chili Pepper, Sodium Benzoate (Preservative), Caramel Color, Beet Powder.\nMUSTARD: \nIngredients: Distilled Vinegar, Water, Mustard Seed, Salt, Turmeric, Paprika, Spice Extractive.\nMcChicken\u0000 Patty: \nIngredients:  Chicken, Water, Salt, Sodium Phosphates.  Battered and Breaded with:  Bleached Wheat Flour, Water, Wheat Flour, Modified Food Starch, Salt, Spices,\nWheat Gluten, Paprika, Dextrose, Yeast, Garlic Powder, Partially Hydrogenated Soybean Oil and Cottonseed Oil with Mono and Diglycerides, Leavening (Sodium\nAcid Pyrophosphate, Baking Soda, Ammonium Bicarbonate, Monocalcium Phosphate), Natural Flavor (Plant Source) with Extractives of Paprika. \nCONTAINS: WHEAT. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness).\nDimethylpolysiloxane added as an antifoaming agent.\nONIONS:\nPASTEURIZED PROCESS AMERICAN CHEESE: \nIngredients: Milk, Cream, Water, Cheese Culture, Sodium Citrate, Contains 2% or Less of:  Salt, Citric Acid, Sodium Phosphate, Sorbic Acid (Preservative), Lactic\nAcid, Acetic Acid, Enzymes, Sodium Pyrophosphate, Natural Flavor (Dairy Source), Color Added, Soy Lecithin (Added for Slice Separation). \nCONTAINS: MILK AND SOY LECITHIN. \nPASTEURIZED PROCESS WHITE CHEDDAR CHEESE: \nIngredients: Milk, Water, Cheese Culture, Cream, Sodium Citrate, Contains 2% or less of: Salt, Citric Acid, Sorbic Acid (Preservative), May Contain One or More of:\nSodium Phosphate, Sodium Pyrophosphate, Sodium Hexametaphosphate, Enzymes, Acetic Acid, Soy Lecithin (Added for Slice Separation). \nCONTAINS: MILK AND SOY LECITHIN. \nPICKLE SLICES: \nIngredients: Cucumbers, Water, Distilled Vinegar, Salt, Calcium Chloride, Alum, Potassium Sorbate (Preservative), Natural Flavors (Plant Source), Polysorbate 80,\nExtractives of Turmeric (Color).\nQUARTER POUND 100% BEEF PATTY*: \nIngredients: 100% Pure USDA Inspected Beef; No Fillers, No Extenders.\nPrepared With Grill Seasoning (Salt, Black Pepper).\n*Based On The Weight Before Cooking 4 Oz. (113.4g)\nRED ONIONS:\nREGULAR BUN: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, High Fructose\nCorn Syrup and/or Sugar, Yeast, Soybean Oil and/or Canola Oil, Contains 2% or Less: Salt, Wheat Gluten, Calcium Sulfate, Calcium Carbonate, Ammonium Sulfate,\nAmmonium Chloride, Dough Conditioners (May Contain One or More of: Sodium Stearoyl Lactylate, DATEM, Ascorbic Acid, Azodicarbonamide, Mono and\nDiglycerides, Ethoxylated Monoglycerides, Monocalcium Phosphate, Enzymes, Guar Gum, Calcium Peroxide), Sorbic Acid, Calcium Propionate and/or Sodium\nPropionate (Preservatives), Soy Lecithin. \nCONTAINS: WHEAT, SOY LECITHIN. \nSEASONED RICE VINEGAR: \nIngredients: Rice Vinegar, Water, Sugar, Soybean Oil, Brown Sugar, Salt, Xanthan Gum, Potassium Sorbate (Preservative), Soy Sauce (Soybeans, Wheat, Salt),\nMaltodextrin. \nCONTAINS: SOY AND WHEAT. \nSESAME SEED BUN: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, High Fructose\nCorn Syrup and/or Sugar, Yeast, Soybean Oil and/or Canola Oil, Contains 2% Or Less: Salt, Wheat Gluten, Calcium Sulfate, Calcium Carbonate, Ammonium Sulfate,\nAmmonium Chloride, Dough Conditioners (May Contain One or More of: Sodium Stearoyl Lactylate, DATEM, Ascorbic Acid, Azodicarbonamide, Mono and\nDiglycerides, Ethoxylated Monoglycerides, Monocalcium Phosphate, Enzymes, Guar Gum, Calcium Peroxide), Sorbic Acid, Calcium Propionate and/or Sodium\nPropionate (Preservatives), Soy Lecithin, Sesame Seed. \nCONTAINS: WHEAT, SOY LECITHIN. \nSHREDDED CHEDDAR/JACK CHEESE: \nIngredients: Cheddar Cheese (Pasteurized Milk, Cheese Culture, Salt, Enzymes, Annatto [Color]), Monterey Jack Cheese (Pasteurized Milk, Cheese Culture, Salt,\nEnzymes), Potato Starch and Corn Starch and Powdered Cellulose (Prevent Caking), Dextrose, Enzymes, Natamycin (Natural Mold Inhibitor). \nCONTAINS: MILK. \nSHREDDED LETTUCE:\nSLIVERED ONIONS:\nSPICY BUFFALO SAUCE: \nIngredients: Cayenne Pepper Sauce (Cayenne Red Peppers, Vinegar, Salt, Garlic), Water, Soybean Oil, Modified Food Starch, Xanthan Gum, Beet Juice (Color),\nNatural Flavor (Plant and Dairy Source), Garlic, Citric Acid, Calcium Disodium EDTA (Protect Flavor), Citric Acid. \nCONTAINS: MILK. \nSPRING MIX: \nIngredients: May contain some or all of the following Baby Whole Leaf Varieties: Baby Green Romaine, Baby Red Romaine, Baby Red Leaf, Baby Green Leaf, Baby\nRed Swiss Chard, Baby Red Oak, Baby Green Oak, Lolla Rosa, Tango, Tatsoi, Arugula, Mizuna, Frisee, Radicchio.\nSWEET CHILI SAUCE: \nIngredients: Water, Sugar, Distilled Vinegar, Cayenne Peppers, Modified Food Starch, Salt, Garlic Puree, Dried Red Peppers, Sodium Benzoate (Preservative).\nSWISS CHEESE: \nIngredients:  Swiss Cheese (Pasteurized Milk, Cheese Culture, Salt, Enzymes), Natamycin (Natural Mold Inhibitor). \nCONTAINS: MILK. \nTANGY HONEY MUSTARD SAUCE: \nIngredients:  Water, Sugar, Dijon Mustard (Distilled Vinegar, Mustard Seed, Salt, Water, White Wine, Spices), Corn Syrup Solids, Honey, Soybean Oil, Distilled\nVinegar, Modified Food Starch, Egg Yolks, Mustard (Water, Distilled Vinegar, Mustard Seed, Salt, Turmeric [Color], Paprika, Spice), Xanthan Gum, Salt, Titanium\nDioxide (Color), Propylene Glycol Alginate, Sodium Benzoate (Preservative), Spice, Yellow 5, Yellow 6. \nCONTAINS: EGG. \nTARTAR SAUCE: \nIngredients:  Soybean Oil, Pickle Relish (Diced Pickles, Vinegar, Salt, Capers, Xanthan Gum, Potassium Sorbate [Preservative], Calcium Chloride, Spice Extractives,\nPolysorbate 80), Egg Yolks, Water, Onions, Distilled Vinegar, Sugar, Spice, Salt, Xanthan Gum, Potassium Sorbate (Preservative), Parsley. \nCONTAINS: EGG. \nTHICK CUT APPLEWOOD SMOKED BACON: \nIngredients: Pork Bellies Cured with Water, Salt, Sugar, Natural Smoke Flavor (Plant Source), Sodium Phosphate, Sodium Erythorbate, Sodium Nitrite.\n \nTOMATO SLICE:\nChicken & Fish\nChicken McNuggets\u0000: \nCHICKEN MCNUGGETS (4 piece)\nMighty Wings (3 piece): \nMIGHTY WINGS\nPremium Crispy Chicken Classic Sandwich: \nCRISPY CHICKEN FILLET, BAKERY STYLE BUN, TOMATO SLICE, MAYONNAISE DRESSING, LEAF LETTUCE\nPremium Grilled Chicken Classic Sandwich: \nGRILLED CHICKEN FILLET, BAKERY STYLE BUN, MAYONNAISE DRESSING, LEAF LETTUCE, TOMATO SLICE\nPremium Crispy Chicken Club Sandwich: \nCRISPY CHICKEN FILLET, BAKERY STYLE BUN, TOMATO SLICE, THICK CUT APPLEWOOD SMOKED BACON, SWISS CHEESE, MAYONNAISE DRESSING,\nLEAF LETTUCE\nPremium Grilled Chicken Club Sandwich: \nBAKERY STYLE BUN, GRILLED CHICKEN FILLET, TOMATO SLICE, THICK CUT APPLEWOOD SMOKED BACON, SWISS CHEESE, MAYONNAISE DRESSING,\nLEAF LETTUCE\nPremium Crispy Chicken Ranch BLT Sandwich: \nCRISPY CHICKEN FILLET, BAKERY STYLE BUN, TOMATO SLICE, THICK CUT APPLEWOOD SMOKED BACON, BUTTERMILK RANCH SAUCE, LEAF\nLETTUCE\nPremium Grilled Chicken Ranch BLT Sandwich: \nGRILLED CHICKEN FILLET, BAKERY STYLE BUN, TOMATO SLICE, THICK CUT APPLEWOOD SMOKED BACON, BUTTERMILK RANCH SAUCE, LEAF\nLETTUCE\nMcChicken ®: \nMCCHICKEN PATTY, REGULAR BUN, MAYONNAISE DRESSING, SHREDDED LETTUCE\nBuffalo Ranch McChicken: \nMCCHICKEN PATTY, REGULAR BUN, SHREDDED LETTUCE, SPICY BUFFALO SAUCE, BUTTERMILK RANCH SAUCE\nBacon Buffalo Ranch McChicken: \nMCCHICKEN PATTY, REGULAR BUN, SHREDDED LETTUCE, THICK CUT APPLEWOOD SMOKED BACON, SPICY BUFFALO SAUCE, BUTTERMILK RANCH\nSAUCE\nBacon Cheddar McChicken: \nMCCHICKEN PATTY, REGULAR BUN, MAYONNAISE DRESSING, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE, SHREDDED LETTUCE, THICK CUT\nAPPLEWOOD SMOKED BACON\nSouthern Style Crispy Chicken Sandwich: \nCRISPY CHICKEN FILLET, REGULAR BUN, PICKLE SLICES, LIQUID MARGARINE\nFilet-O-Fish: \nFISH FILET PATTY, REGULAR BUN, TARTAR SAUCE, PASTEURIZED PROCESS AMERICAN CHEESE\nPremium McWrap Southwest Chicken (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, TOMATO SLICE, SHREDDED LETTUCE, CILANTRO LIME GLAZE, HABANERO RANCH SAUCE, SHREDDED\nCHEDDAR/JACK CHEESE, SPRING MIX, CHILI LIME TORTILLA STRIPS\nPremium McWrap Southwest Chicken (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, TOMATO SLICE, SHREDDED LETTUCE, CILANTRO LIME GLAZE, HABANERO RANCH SAUCE, SHREDDED\nCHEDDAR/JACK CHEESE, SPRING MIX, CHILI LIME TORTILLA STRIPS\nPremium McWrap Chicken & Bacon (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, TOMATO SLICE, SHREDDED CHEDDAR/JACK CHEESE, SPRING MIX, CREAMY\nGARLIC SAUCE, THICK CUT APPLEWOOD SMOKED BACON\nPremium McWrap Chicken & Bacon (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, TOMATO SLICE, SHREDDED CHEDDAR/JACK CHEESE, SPRING MIX, THICK CUT\nAPPLEWOOD SMOKED BACON, CREAMY GARLIC SAUCE\nPremium McWrap Chicken & Ranch (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, CUCUMBER, TOMATO SLICE, SHREDDED CHEDDAR/JACK CHEESE, SPRING MIX,\nBUTTERMILK RANCH SAUCE, SEASONED RICE VINEGAR\nPremium McWrap Chicken & Ranch (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, CUCUMBER, TOMATO SLICE, SHREDDED CHEDDAR/JACK CHEESE, SPRING MIX,\nBUTTERMILK RANCH SAUCE, SEASONED RICE VINEGAR\nPremium McWrap Chicken Sweet Chili (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, CUCUMBER, SWEET CHILI SAUCE, SPRING MIX, CREAMY GARLIC SAUCE\nPremium McWrap Chicken Sweet Chili (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED LETTUCE, CUCUMBER, SWEET CHILI SAUCE, SPRING MIX, CREAMY GARLIC SAUCE\nChipotle BBQ Snack Wrap (Crispy): \nFLOUR TORTILLA, CRISPY CHICKEN FILLET, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, CHIPOTLE BBQ SAUCE\nChipotle BBQ Snack Wrap (Grilled): \nFLOUR TORTILLA, GRILLED CHICKEN FILLET, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, CHIPOTLE BBQ SAUCE\nHoney Mustard Snack Wrap (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, TANGY HONEY MUSTARD SAUCE\nHoney Mustard Snack Wrap (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, TANGY HONEY MUSTARD SAUCE\nRanch Snack Wrap® (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, BUTTERMILK RANCH SAUCE, SHREDDED LETTUCE\nRanch Snack Wrap® (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, BUTTERMILK RANCH SAUCE\nPremium Bacon Ranch Salad with Crispy Chicken: \nCRISPY CHICKEN FILLET, SALAD MIX, GRAPE TOMATOES, SHREDDED CHEDDAR/JACK CHEESE, BACON BITS\nPremium Bacon Ranch Salad with Grilled Chicken: \nGRILLED CHICKEN FILLET, SALAD MIX, GRAPE TOMATOES, SHREDDED CHEDDAR/JACK CHEESE, BACON BITS\nPremium Southwest Salad with Crispy Chicken: \nCRISPY CHICKEN FILLET, SALAD MIX, SOUTHWEST VEGETABLE BLEND, CILANTRO LIME GLAZE, SHREDDED CHEDDAR/JACK CHEESE, CHILI LIME\nTORTILLA STRIPS, LIME\nPremium Southwest Salad with Grilled Chicken: \nGRILLED CHICKEN FILLET, SALAD MIX, SOUTHWEST VEGETABLE BLEND, SHREDDED CHEDDAR/JACK CHEESE, CILANTRO LIME GLAZE, CHILI LIME\nTORTILLA STRIPS, LIME\nChicken Selects\u0000 Premium Breast Strips: \nChicken Selects Premium Breast Strips (5 pc)\nSpicy Chicken McBites™ Shareable Size†: \nSPICY CHICKEN MCBITES\nMighty Wings (10 piece): \nMIGHTY WINGS\nMighty Wings (5 piece): \nMIGHTY WINGS\nSpicy Chicken McBites™ Snack Size†: \nSPICY CHICKEN MCBITES\nBACON BITS: \nIngredients:  Pork Bellies Cured with Water, Salt, Sugar, Natural Smoke Flavor (Plant Source), Sodium Phosphate, Sodium Erythorbate, Sodium Nitrite.\nBAKERY STYLE BUN: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, Whole Wheat\nFlour, High Fructose Corn Syrup, Honey, Wheat Gluten, Contains 2% or Less of: Yeast, Soybean Oil, Maltodextrin (Dietary Fiber), Salt, Calcium Sulfate, Dough\nConditioners (Wheat Flour, DATEM, Ascorbic Acid, Azodicarbonamide, Sodium Stearoyl Lactylate, Mono and Diglycerides, Enzymes, Calcium Peroxide), Ammonium\nSulfate, Natural Flavor (Botanical Source), Calcium Propionate (Preservative), Vitamin D3, Rolled Wheat (Topping). \nCONTAINS: WHEAT. \nBUTTERMILK RANCH SAUCE: \nIngredients:  Soybean Oil, Cultured Buttermilk, Water, Sour Cream (Milk, Cultured Cream, Modified Food Starch, Guar Gum, Sodium Phosphates, Carob Bean Gum,\nSodium Citrate, Calcium Sulfate, Carrageenan, Dextrose, Potassium Sorbate, Citric Acid, Gelatin, Mono- and Diglycerides), Egg Yolks, Contains 2% or Less: Distilled\nVinegar, Maltodextrin, Salt, Dextrose, Modified Food Starch, Soy Sauce (Soybeans, Wheat, Salt), Dried Onion, Garlic Powder, Lactic Acid, Natural (Plant and Dairy\nSources) and Artificial Flavors, Shallots, Preservatives (Sodium Benzoate, Potassium Sorbate, Calcium Disodium EDTA), Xanthan Gum, Spice, Phosphoric Acid,\nSodium Acid Sulfate, Propylene Glycol Alginate, Autolyzed Yeast Extract. \nCONTAINS: MILK, EGG, SOY, WHEAT. \nCHICKEN MCNUGGETS: \nIngredients: White Boneless Chicken, Water, Food Starch-Modified, Salt, Seasoning (Autolyzed Yeast Extract, Salt, Wheat Starch, Natural Flavoring [Botanical\nSource], Safflower Oil, Dextrose, Citric Acid), Sodium Phosphates, Natural Flavor (Botanical Source).  Battered and Breaded with: Water, Enriched Flour (Bleached\nWheat Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Yellow Corn Flour, Bleached Wheat Flour,  Food Starch-Modified, Salt, Leavening\n(Baking Soda, Sodium Acid Pyrophosphate, Sodium Aluminum Phosphate, Monocalcium Phosphate, Calcium Lactate), Spices, Wheat Starch, Dextrose, Corn\nStarch. \nCONTAINS: WHEAT\n \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness). \nDimethylpolysiloxane added as an antifoaming agent.Prepared in vegetable oil (Canola oil, corn oil, soybean oil, hydrogenated soybean oil with TBHQ and citric acid\nadded to preserve freshness).  Dimethylpolysiloxane added as an antifoaming agent.\nCHICKEN MCNUGGETS (10 piece): \nIngredients: White Boneless Chicken, Water, Food Starch-Modified, Salt, Seasoning (Autolyzed Yeast Extract, Salt, Wheat Starch, Natural Flavoring [Botanical\nSource], Safflower Oil, Dextrose, Citric Acid), Sodium Phosphates, Natural Flavor (Botanical Source).  Battered and Breaded with: Water, Enriched Flour (Bleached\nWheat Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Yellow Corn Flour, Bleached Wheat Flour,  Food Starch-Modified, Salt, Leavening\n(Baking Soda, Sodium Acid Pyrophosphate, Sodium Aluminum Phosphate, Monocalcium Phosphate, Calcium Lactate), Spices, Wheat Starch, Dextrose, Corn\nStarch. \nCONTAINS: WHEAT\n \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness). \nDimethylpolysiloxane added as an antifoaming agent.Prepared in vegetable oil (Canola oil, corn oil, soybean oil, hydrogenated soybean oil with TBHQ and citric acid\nadded to preserve freshness).  Dimethylpolysiloxane added as an antifoaming agent.\nCHICKEN MCNUGGETS (4 piece): \nIngredients: White Boneless Chicken, Water, Food Starch-Modified, Salt, Seasoning (Autolyzed Yeast Extract, Salt, Wheat Starch, Natural Flavoring [Botanical\nSource], Safflower Oil, Dextrose, Citric Acid), Sodium Phosphates, Natural Flavor (Botanical Source).  Battered and Breaded with: Water, Enriched Flour (Bleached\nWheat Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Yellow Corn Flour, Bleached Wheat Flour,  Food Starch-Modified, Salt, Leavening\n(Baking Soda, Sodium Acid Pyrophosphate, Sodium Aluminum Phosphate, Monocalcium Phosphate, Calcium Lactate), Spices, Wheat Starch, Dextrose, Corn\nStarch. \nCONTAINS: WHEAT\n \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness). \nDimethylpolysiloxane added as an antifoaming agent.Prepared in vegetable oil (Canola oil, corn oil, soybean oil, hydrogenated soybean oil with TBHQ and citric acid\nadded to preserve freshness).  Dimethylpolysiloxane added as an antifoaming agent.\nCHICKEN MCNUGGETS (6 piece): \nIngredients: White Boneless Chicken, Water, Food Starch-Modified, Salt, Seasoning (Autolyzed Yeast Extract, Salt, Wheat Starch, Natural Flavoring [Botanical\nSource], Safflower Oil, Dextrose, Citric Acid), Sodium Phosphates, Natural Flavor (Botanical Source).  Battered and Breaded with: Water, Enriched Flour (Bleached\nWheat Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Yellow Corn Flour, Bleached Wheat Flour,  Food Starch-Modified, Salt, Leavening\n(Baking Soda, Sodium Acid Pyrophosphate, Sodium Aluminum Phosphate, Monocalcium Phosphate, Calcium Lactate), Spices, Wheat Starch, Dextrose, Corn\nStarch. \nCONTAINS: WHEAT\n \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness). \nDimethylpolysiloxane added as an antifoaming agent.Prepared in vegetable oil (Canola oil, corn oil, soybean oil, hydrogenated soybean oil with TBHQ and citric acid\nadded to preserve freshness).  Dimethylpolysiloxane added as an antifoaming agent.\nCHILI LIME TORTILLA STRIPS: \nIngredients:  Corn, Vegetable Oil (Corn, Soybean and Sunflower Oil), Salt, Maltodextrin, Sugar, Dried Tomato, Dextrose, Spices, Onion Powder, Green Bell Pepper\nPowder, Citric Acid, Autolyzed Yeast Extract, Malic Acid, Paprika Extract (Color), Disodium Inosinate, Disodium Guanylate, Natural Flavor (Plant Source), Lemon\nExtract, Spice Extractive.\nCHIPOTLE BBQ SAUCE: \nIngredients: High Fructose Corn Syrup, Water, Tomato Paste, Honey, Distilled Vinegar, Molasses, Modified Food Starch, Natural (Plant Source) and Artificial Flavors,\nSalt, Dried Chipotle Peppers, Natural Smoke Flavor (Plant Source), Dried Chili Peppers, Soybean Oil, Sodium Benzoate and Potassium Sorbate (Preservatives),\nOnion Powder, Garlic Powder, Caramel Color, Propylene Glycol Alginate, Spice.\nCILANTRO LIME GLAZE: \nIngredients: Water, Corn Syrup Solids, High Fructose Corn Syrup, Sugar, Distilled Vinegar, Olive Oil, Soybean Oil, Freeze-Dried Orange Juice Concentrate, Cilantro,\nSalt, Freeze-Dried Lime Juice Concentrate, Xanthan Gum, Sodium Benzoate and Potassium Sorbate (Preservatives), Garlic Powder, Propylene Glycol Alginate,\nSpice, Onion Powder, Citric Acid.\nCREAMY GARLIC SAUCE: \nIngredients: Yogurt (Cultured Nonfat Milk, Modified Food Starch, Gelatin, Pectin), Water, Soybean Oil, Distilled Vinegar, Whey Protein Concentrate, Egg Yolks,\nRoasted Garlic (Garlic Puree, Evaporated Cane Syrup), Sugar, Modified Food Starch, Rice Vinegar, Salt, Xanthan Gum, Propylene Glycol Alginate, Potassium\nSorbate and Sodium Benzoate (Preservatives), Sodium Acid Sulfate, Natural Flavor (Plant Source), Calcium Disodium EDTA (Protect Flavor). \nCONTAINS: EGG AND MILK. \nCRISPY CHICKEN FILLET: \nIngredients: Chicken Breast Fillet with Rib Meat, Water, Seasoning (Sugar, Salt, Sodium Phosphates, Modified Tapioca Starch, Spice, Autolyzed Yeast Extract,\nCarrageenan, Natural [Vegetable and Botanical Source] and Artificial Flavors, Maltodextrin, Sunflower Lecithin, Gum Arabic). Battered and Breaded with: Bleached\nWheat Flour, Water, Wheat Flour, Sugar, Salt, Modified Food Starch, Yellow Corn Flour, Leavening (Sodium Acid Pyrophosphate, Baking Soda, Sodium Aluminum\nPhosphate, Monocalcium Phosphate, Ammonium Bicarbonate), Wheat Gluten, Spices, Corn Starch, Dextrose, Xanthan Gum, Extractives of Paprika. \nCONTAINS: WHEAT. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness).\nDimethylpolysiloxane added as an antifoaming agent.\nCUCUMBER: \nIngredients: Cucumber\nChicken Selects Premium Breast Strips (5 pc): \nChicken breast strips with rib meat, water, seasoning [potato starch, salt, autolyzed yeast extract, maltodextrin, chicken broth, natural flavors (plant and animal\nsource), spice, chicken fat, sunflower lecithin], sodium phosphates.  Battered and breaded with: wheat flour, water, food starch-modified, leavening (baking soda,\nsodium aluminum phosphate, monocalcium phosphate, sodium acid pyrophosphate), spices, salt, modified cellulose gum, wheat gluten, garlic powder, onion powder,\nsoybean oil, xanthan gum, spice extractives, extractives of paprika (color). \nCONTAINS: WHEAT. \nPrepared in vegetable oil (Canola oil, corn oil, soybean oil, hydrogenated soybean oil with TBHQ and citric acid added to preserve freshness).  Dimethylpolysiloxane\nadded as an antifoaming agent.\nFISH FILET PATTY: \nIngredients: Pollock, Wheat Flour, Water, Modified Food Starch, Contains 2% or Less: Yellow Corn Flour, Bleached Wheat Flour, Salt, Whey, Dextrose, Dried Yeast,\nSugar, Cellulose Gum, Colored with Paprika and Turmeric Extract, Spice Extractives. \nCONTAINS: FISH (POLLOCK), WHEAT AND MILK. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid Added to Preserve Freshness).\nDimethylpolysiloxane Added as an Antifoaming Agent.\nFLOUR TORTILLA: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, Shortening\n(Interesterified Soybean Oil and/or Hydrogenated Soybean Oil and/or Soybean Oil and/or Hydrogenated Cottonseed Oil), Contains 2% or Less of: Sugar, Leavening\n(May Contain One or More of: Baking Soda, Sodium Aluminum Sulfate, Corn Starch, Sodium Acid Pyrophosphate, Calcium Sulfate, Monocalcium Phosphate), Salt,\nWheat Gluten, Dough Conditioners (Sodium Metabisulfite [Contains Sulfites], Distilled Monoglycerides). \nCONTAINS: WHEAT. \nGRAPE TOMATOES:\nGRILLED CHICKEN FILLET: \nIngredients: Chicken Breast Fillet with Rib Meat, Water, Seasoning (Rice Starch, Salt, Sugar, Yeast Extract, Canola Oil, Onion Powder, Maltodextrin, Chicken Skin,\nPaprika, Flavor, Sunflower Oil, Chicken, Garlic Powder, Chicken Fat, Spices), Sodium Phosphates.\n \nPrepared with Liquid Margarine: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin,\nMono-and Diglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN\nPrepared with Liquid Margarine: Liquid soybean oil and hydrogenated cottonseed and soybean oils, water, partially hydrogenated soybean oil, salt, soy\nlecithin, mono-and diglycerides, sodium benzoate and potassium sorbate (preservatives), artificial flavor, citric acid, vitamin A palmitate, beta carotene\n(color). \n \nCONTAINS: SOY LECITHIN. \nHABANERO RANCH SAUCE: \nIngredients: Water, Soybean Oil, Corn Syrup Solids, Distilled Vinegar, Buttermilk Powder, Egg Yolks, Maltodextrin, Dried Cayenne Red Pepper Sauce (Aged\nCayenne Red Peppers, Vinegar, Salt, Garlic), Sugar, Corn Starch, Modified Food Starch, Contains 1% or Less:  Salt, Spice and Spice Extractives, Natural Flavor\n(Dairy and Animal Sources), Lemon Juice Concentrate, Lactic Acid, Habanero Pepper, Red Bell Pepper Powder, Sodium Benzoate and Potassium Sorbate\n(Preservatives), Xanthan Gum, Propylene Glycol Alginate, Apple Cider Vinegar. \nCONTAINS: MILK, EGG. \nLEAF LETTUCE:\nLIME: \nIngredients: Lime\nLIQUID MARGARINE: \nIngredients: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin, Mono and\nDiglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN. \nMAYONNAISE DRESSING: \nIngredients: Water, Soybean Oil, Distilled Vinegar, Maltodextrin, Modified Food Starch, Enzyme Modified Egg Yolk, Salt, Sugar, Xanthan Gum, Mustard Flour,\nPotassium Sorbate (Preservative), Lemon Juice Concentrate, Polysorbate 80, Natural Flavor (Animal Source), Calcium Disodium EDTA to Protect Flavor, Beta\nCarotene (Color). \nCONTAINS: EGG. \nMIGHTY WINGS: \nIngredients: Chicken Wing Sections, Water, Salt, Rice Starch, Sodium Phosphates, Spice Extractives, Maltodextrin, Extractives of Garlic and Onion.  Battered and\nBreaded with: Water, Bleached Wheat Flour, Wheat Flour, Modified Food Starch, Yellow Corn Flour, Wheat Gluten, Salt, Leavening (Sodium Acid Pyrophosphate,\nSodium Bicarbonate), Rice Flour, Spices, Spice Extractives, Extractives of Paprika, Sugar, Onion Powder, Yeast, Xanthan Gum. \nCONTAINS: WHEAT. \nPrepared in vegetable oil (canola oil, corn oil, soybean oil, hydrogenated soybean oil with TBHQ and citric acid added to preserve freshness).  Dimethylpolysiloxane\nadded as an antifoaming agent.\nMcChicken\u0000 Patty: \nIngredients:  Chicken, Water, Salt, Sodium Phosphates.  Battered and Breaded with:  Bleached Wheat Flour, Water, Wheat Flour, Modified Food Starch, Salt, Spices,\nWheat Gluten, Paprika, Dextrose, Yeast, Garlic Powder, Partially Hydrogenated Soybean Oil and Cottonseed Oil with Mono and Diglycerides, Leavening (Sodium\nAcid Pyrophosphate, Baking Soda, Ammonium Bicarbonate, Monocalcium Phosphate), Natural Flavor (Plant Source) with Extractives of Paprika. \nCONTAINS: WHEAT. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness).\nDimethylpolysiloxane added as an antifoaming agent.\nPASTEURIZED PROCESS AMERICAN CHEESE: \nIngredients: Milk, Cream, Water, Cheese Culture, Sodium Citrate, Contains 2% or Less of:  Salt, Citric Acid, Sodium Phosphate, Sorbic Acid (Preservative), Lactic\nAcid, Acetic Acid, Enzymes, Sodium Pyrophosphate, Natural Flavor (Dairy Source), Color Added, Soy Lecithin (Added for Slice Separation). \nCONTAINS: MILK AND SOY LECITHIN. \nPASTEURIZED PROCESS WHITE CHEDDAR CHEESE: \nIngredients: Milk, Water, Cheese Culture, Cream, Sodium Citrate, Contains 2% or less of: Salt, Citric Acid, Sorbic Acid (Preservative), May Contain One or More of:\nSodium Phosphate, Sodium Pyrophosphate, Sodium Hexametaphosphate, Enzymes, Acetic Acid, Soy Lecithin (Added for Slice Separation). \nCONTAINS: MILK AND SOY LECITHIN. \nPICKLE SLICES: \nIngredients: Cucumbers, Water, Distilled Vinegar, Salt, Calcium Chloride, Alum, Potassium Sorbate (Preservative), Natural Flavors (Plant Source), Polysorbate 80,\nExtractives of Turmeric (Color).\nREGULAR BUN: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, High Fructose\nCorn Syrup and/or Sugar, Yeast, Soybean Oil and/or Canola Oil, Contains 2% or Less: Salt, Wheat Gluten, Calcium Sulfate, Calcium Carbonate, Ammonium Sulfate,\nAmmonium Chloride, Dough Conditioners (May Contain One or More of: Sodium Stearoyl Lactylate, DATEM, Ascorbic Acid, Azodicarbonamide, Mono and\nDiglycerides, Ethoxylated Monoglycerides, Monocalcium Phosphate, Enzymes, Guar Gum, Calcium Peroxide), Sorbic Acid, Calcium Propionate and/or Sodium\nPropionate (Preservatives), Soy Lecithin. \nCONTAINS: WHEAT, SOY LECITHIN. \nSALAD MIX: \nIngredients: Iceberg Lettuce, Romaine Lettuce, Spring Mix (May Contain Baby Red Romaine, Baby Green Romaine, Baby Red Leaf, Baby Green Leaf, Baby Red\nSwiss Chard, Baby Red Oak, Baby Green Oak, Parella, Lolla Rosa, Tango, Totsoi, Arugula, Mizuna, Radicchio, Frisee), Carrots.\n \nCURRENTLY, OUR SALADS DO NOT CONTAIN SPINACH.\nSEASONED RICE VINEGAR: \nIngredients: Rice Vinegar, Water, Sugar, Soybean Oil, Brown Sugar, Salt, Xanthan Gum, Potassium Sorbate (Preservative), Soy Sauce (Soybeans, Wheat, Salt),\nMaltodextrin. \nCONTAINS: SOY AND WHEAT. \nSHREDDED CHEDDAR/JACK CHEESE: \nIngredients: Cheddar Cheese (Pasteurized Milk, Cheese Culture, Salt, Enzymes, Annatto [Color]), Monterey Jack Cheese (Pasteurized Milk, Cheese Culture, Salt,\nEnzymes), Potato Starch and Corn Starch and Powdered Cellulose (Prevent Caking), Dextrose, Enzymes, Natamycin (Natural Mold Inhibitor). \nCONTAINS: MILK. \nSHREDDED LETTUCE:\nSOUTHWEST VEGETABLE BLEND: \nIngredients:  Roasted Corn, Black Beans, Roasted Tomato, Poblano Pepper, Lime Juice (Water, Lime Juice Concentrate, Lime Oil), Cilantro.\nSPICY BUFFALO SAUCE: \nIngredients: Cayenne Pepper Sauce (Cayenne Red Peppers, Vinegar, Salt, Garlic), Water, Soybean Oil, Modified Food Starch, Xanthan Gum, Beet Juice (Color),\nNatural Flavor (Plant and Dairy Source), Garlic, Citric Acid, Calcium Disodium EDTA (Protect Flavor), Citric Acid. \nCONTAINS: MILK. \nSPICY CHICKEN MCBITES: \nIngredients:  Chicken Breast Chunks with Rib Meat, Water, Salt, Modified Food Starch, Yeast Extract, Sodium Phosphates, Dried Chicken Broth, Garlic Powder,\nSpice, Onion Powder, Chicken Fat, Natural Flavor (Plant Source), Soybean Oil, Maltodextrin, Citric Acid, Vinegar.  Battered and Breaded with:  Bleached Wheat\nFlour, Water, Wheat Flour, Palm Oil, Modified Food Starch, Leavening (Baking Soda, Sodium Aluminum Phosphate, Monocalcium Phosphate), Tapioca Maltodextrin,\nSalt, Extractives of Paprika, Spice Extractives, Maltodextrin, Garlic Powder, Onion Powder, Artificial Flavor, Lactic Acid. \nCONTAINS: WHEAT. \nPrepared in vegetable oil (canola oil, corn oil, soybean oil, hydrogenated soybean oil with TBHQ and citric acid added to preserve freshness).  Dimethylpolysiloxane\nadded as an antifoaming agent.\nSPRING MIX: \nIngredients: May contain some or all of the following Baby Whole Leaf Varieties: Baby Green Romaine, Baby Red Romaine, Baby Red Leaf, Baby Green Leaf, Baby\nRed Swiss Chard, Baby Red Oak, Baby Green Oak, Lolla Rosa, Tango, Tatsoi, Arugula, Mizuna, Frisee, Radicchio.\nSWEET CHILI SAUCE: \nIngredients: Water, Sugar, Distilled Vinegar, Cayenne Peppers, Modified Food Starch, Salt, Garlic Puree, Dried Red Peppers, Sodium Benzoate (Preservative).\nSWISS CHEESE: \nIngredients:  Swiss Cheese (Pasteurized Milk, Cheese Culture, Salt, Enzymes), Natamycin (Natural Mold Inhibitor). \nCONTAINS: MILK. \nTANGY HONEY MUSTARD SAUCE: \nIngredients:  Water, Sugar, Dijon Mustard (Distilled Vinegar, Mustard Seed, Salt, Water, White Wine, Spices), Corn Syrup Solids, Honey, Soybean Oil, Distilled\nVinegar, Modified Food Starch, Egg Yolks, Mustard (Water, Distilled Vinegar, Mustard Seed, Salt, Turmeric [Color], Paprika, Spice), Xanthan Gum, Salt, Titanium\nDioxide (Color), Propylene Glycol Alginate, Sodium Benzoate (Preservative), Spice, Yellow 5, Yellow 6. \nCONTAINS: EGG. \nTARTAR SAUCE: \nIngredients:  Soybean Oil, Pickle Relish (Diced Pickles, Vinegar, Salt, Capers, Xanthan Gum, Potassium Sorbate [Preservative], Calcium Chloride, Spice Extractives,\nPolysorbate 80), Egg Yolks, Water, Onions, Distilled Vinegar, Sugar, Spice, Salt, Xanthan Gum, Potassium Sorbate (Preservative), Parsley. \nCONTAINS: EGG. \nTHICK CUT APPLEWOOD SMOKED BACON: \nIngredients: Pork Bellies Cured with Water, Salt, Sugar, Natural Smoke Flavor (Plant Source), Sodium Phosphate, Sodium Erythorbate, Sodium Nitrite.\n \nTOMATO SLICE:\nBreakfast\nFruit 'n Yogurt Parfait: \nLOWFAT YOGURT (for Parfaits), STRAWBERRIES, BLUEBERRIES (for Parfait), LOW FAT CRUNCHY GRANOLA\nEgg McMuffin®: \nENGLISH MUFFIN WITH 8 g WHOLE GRAIN  , EGG, PASTEURIZED PROCESS AMERICAN CHEESE, CANADIAN STYLE BACON, LIQUID MARGARINE\nEgg White Delight: \nENGLISH MUFFIN WITH 8 g WHOLE GRAIN  , EGG WHITES, CANADIAN STYLE BACON, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE, LIQUID\nMARGARINE\nSausage McMuffin®: \nENGLISH MUFFIN WITH 8 g WHOLE GRAIN  , SAUSAGE PATTY, PASTEURIZED PROCESS AMERICAN CHEESE, LIQUID MARGARINE\nSausage McMuffin® with Egg: \nENGLISH MUFFIN WITH 8 g WHOLE GRAIN  , SAUSAGE PATTY, EGG, PASTEURIZED PROCESS AMERICAN CHEESE, LIQUID MARGARINE\nSteak & Egg McMuffin: \nENGLISH MUFFIN WITH 8 g WHOLE GRAIN  , BREAKFAST STEAK PATTIE, EGG, PASTEURIZED PROCESS AMERICAN CHEESE, CARAMELIZED GRILLED\nONIONS, LIQUID MARGARINE\nBacon, Egg & Cheese Biscuit (Regular Size Biscuit): \nBISCUIT (REGULAR), FOLDED EGG, PASTEURIZED PROCESS AMERICAN CHEESE, THICK CUT APPLEWOOD SMOKED BACON\nSausage Biscuit (Regular Size Biscuit): \nBISCUIT (REGULAR), SAUSAGE PATTY\nSausage Biscuit with Egg (Regular Size Biscuit): \nBISCUIT (REGULAR), SAUSAGE PATTY, FOLDED EGG\nSteak & Egg Biscuit (Regular Biscuit): \nBISCUIT (REGULAR), BREAKFAST STEAK PATTIE, FOLDED EGG, PASTEURIZED PROCESS AMERICAN CHEESE, CARAMELIZED GRILLED ONIONS\nBacon, Egg & Cheese McGriddles: \nGRIDDLE CAKES, FOLDED EGG, PASTEURIZED PROCESS AMERICAN CHEESE, THICK CUT APPLEWOOD SMOKED BACON\nSausage McGriddles®: \nGRIDDLE CAKES, SAUSAGE PATTY\nSausage, Egg & Cheese McGriddles®: \nGRIDDLE CAKES, SAUSAGE PATTY, FOLDED EGG, PASTEURIZED PROCESS AMERICAN CHEESE\nBacon, Egg & Cheese Bagel†: \nBAGEL, FOLDED EGG, PASTEURIZED PROCESS AMERICAN CHEESE, THICK CUT APPLEWOOD SMOKED BACON, BREAKFAST SAUCE, LIQUID\nMARGARINE\nSteak, Egg & Cheese Bagel†: \nBAGEL, BREAKFAST STEAK PATTIE, FOLDED EGG, PASTEURIZED PROCESS AMERICAN CHEESE, CARAMELIZED GRILLED ONIONS, BREAKFAST\nSAUCE, LIQUID MARGARINE\nBig Breakfast® (Regular Size Biscuit): \nSCRAMBLED EGGS, SAUSAGE PATTY, HASH BROWNS, BISCUIT (REGULAR)\nBig Breakfast  with Hotcakes (Regular Size Biscuit) : \nSCRAMBLED EGGS, SAUSAGE PATTY, BISCUIT (REGULAR), HASH BROWNS, HOTCAKES (3)\nCinnamon Melts: \nEnriched flour (bleached wheat flour, malted barley flour, niacin, reduced iron, thiamin mononitrate, riboflavin, folic acid), water, sugar, margarine [palm oil, soybean\noil, water, salt, whey, partially hydrogenated soybean oil, mono- and diglycerides, soy lecithin, sodium benzoate (preservative), lactic acid (protect flavor), artificial\nflavor, beta carotene (color), vitamin A palmitate], brown sugar, shortening (palm oil, soybean oil, mono- and diglycerides, soy lecithin), eggs, cream cheese powder\n[a dehydrated blend of cream cheese (pasteurized milk and cream, cheese cultures, salt, carob bean gum), nonfat dry milk, disodium phosphate, natural flavor\n(vegetable source)], cinnamon, nonfat dry milk, yeast, contains 2% or less of the following: salt, soybean oil, natural (plant and dairy source) and artificial flavors,\nmono- and diglycerides, sodium alginate, sodium stearoyl lactylate, polysorbate 60, titanium dioxide (color), potassium sorbate (preservative), enzymes, pectin. \nCONTAINS: WHEAT, EGG, MILK, SOY LECITHIN.\nHotcakes : \nHOTCAKES (3)\nHotcakes and Sausage : \nHOTCAKES (3), SAUSAGE PATTY\nSouthern Style Chicken Biscuit (Regular Size Biscuit): \nBISCUIT (REGULAR), SOUTHERN STYLE CRISPY BREAKFAST CHICKEN BREAST FIL\nSausage Burrito: \nFLOUR TORTILLA, SAUSAGE & SCRAMBLED EGG MIX, PASTEURIZED PROCESS AMERICAN CHEESE\nHash Brown: \nPotatoes, vegetable oil (canola oil, hydrogenated soybean oil, natural beef flavor [wheat and milk derivatives]*, citric acid [preservative]), salt, corn flour, dehydrated\npotato, dextrose, sodium acid pyrophosphate (maintain color), extractives of black pepper. Prepared in vegetable oil: Canola oil, corn oil, soybean oil, hydrogenated\nsoybean oil with TBHQ and citric acid added to preserve freshness. Dimethylpolysiloxane added as an antifoaming agent. \nCONTAINS: WHEAT AND MILK. \n*(Natural beef flavor contains hydrolyzed wheat and hydrolyzed milk as starting ingredients).\nBacon, Egg & Cheese Biscuit (Large Size Biscuit): \nBISCUIT (LARGE), FOLDED EGG, PASTEURIZED PROCESS AMERICAN CHEESE, THICK CUT APPLEWOOD SMOKED BACON\nBig Breakfast with Hotcakes (Large Size Biscuit): \nSCRAMBLED EGGS, SAUSAGE PATTY, BISCUIT (LARGE), HASH BROWNS, HOTCAKES (3)\nBig Breakfast® (Large Size Biscuit): \nSCRAMBLED EGGS, SAUSAGE PATTY, HASH BROWNS, BISCUIT (LARGE)\nSausage Biscuit (Large Size Biscuit): \nBISCUIT (LARGE), SAUSAGE PATTY\nSausage Biscuit with Egg (Large Size Biscuit): \nBISCUIT (LARGE), SAUSAGE PATTY, FOLDED EGG\nSouthern Style Chicken Biscuit (Large Size Biscuit): \nBISCUIT (LARGE), SOUTHERN STYLE CRISPY BREAKFAST CHICKEN BREAST FIL\nBacon, Egg & Cheese Bagel with Egg Whites: \nBAGEL, EGG WHITES, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE, THICK CUT APPLEWOOD SMOKED BACON, BREAKFAST SAUCE, LIQUID\nMARGARINE\nBacon, Egg & Cheese Biscuit with Egg Whites (Large Biscuit): \nBISCUIT (LARGE), EGG WHITES, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE, THICK CUT APPLEWOOD SMOKED BACON\nBacon, Egg & Cheese Biscuit with Egg Whites (RegularBiscuit): \nBISCUIT (REGULAR), EGG WHITES, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE, THICK CUT APPLEWOOD SMOKED BACON\nBacon, Egg & Cheese McGriddles with Egg Whites: \nGRIDDLE CAKES, EGG WHITES, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE, THICK CUT APPLEWOOD SMOKED BACON\nBig Breakfast with Egg Whites (Large Size Biscuit): \nEGG WHITES, BISCUIT (LARGE), HASH BROWNS, SAUSAGE PATTY\nBig Breakfast with Egg Whites (Regular Size Biscuit) : \nEGG WHITES, BISCUIT (REGULAR), HASH BROWNS, SAUSAGE PATTY\nBig Breakfast with Hotcakes and Egg Whites (Large Biscuit): \nHOTCAKES (3), EGG WHITES, BISCUIT (LARGE), HASH BROWNS, SAUSAGE PATTY\nBig Breakfast with Hotcakes and Egg Whites (Regular Biscuit): \nHOTCAKES (3), EGG WHITES, BISCUIT (REGULAR), HASH BROWNS, SAUSAGE PATTY\nFruit & Maple Oatmeal  †: \nOATMEAL, DICED APPLES, CRANBERRY RAISIN BLEND, LIGHT CREAM\nFruit & Maple Oatmeal without Brown Sugar†: \nOATMEAL without Brown Sugar, CRANBERRY RAISIN BLEND, DICED APPLES, LIGHT CREAM\nSausage Biscuit with Egg Whites (Large Size Biscuit): \nBISCUIT (LARGE), EGG WHITES, SAUSAGE PATTY\nSausage Biscuit with Egg Whites (Regular Size Biscuit): \nBISCUIT (REGULAR), EGG WHITES, SAUSAGE PATTY\nSausage McMuffin with Egg Whites: \nENGLISH MUFFIN WITH 8 g WHOLE GRAIN  , EGG WHITES, SAUSAGE PATTY, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE, LIQUID MARGARINE\nSausage, Egg & Cheese McGriddles with Egg Whites: \nGRIDDLE CAKES, EGG WHITES, SAUSAGE PATTY, PASTEURIZED PROCESS WHITE CHEDDAR CHEESE\nBAGEL: \nIngredients:  Enriched Flour (Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, Brown Sugar, Sugar,\nContains 2% or Less: Salt, Yeast, Rice Flour, Oat Fiber, Propylene Glycol, Inactive Yeast, Monocalcium Phosphate, Modified Food Starch, Corn Starch, Sodium\nAlginate, Dough Conditioners (Ascorbic Acid, Mono and Diglycerides, Enzymes, Calcium Iodate, Potassium Iodate, Azodicarbonamide), Solubilized Wheat Gluten,\nModified Tapioca Starch, Wheat Gluten, Polysorbate 60, Soy Lecithin, Calcium Propionate and Sodium Metabisulfite as Preservatives (Contains Sulfites), Soy Flour. \nCONTAINS: WHEAT AND SOY. \nBISCUIT (LARGE): \nIngredients:  Enriched Flour (Bleached Wheat Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Cultured Nonfat Buttermilk, Vegetable Oil\n(Palm Oil, Palm Kernel Oil), Water, Leavening (Baking Soda, Sodium Aluminum Phosphate, Monocalcium Phosphate), Contains 2% Or Less: Salt, Sugar, Modified\nCellulose, Wheat Protein Isolate, Natural Flavor (Dairy and Vegetable Source), Soy Lecithin. \nCONTAINS: WHEAT, MILK AND SOY LECITHIN. \nPrepared with Liquid Margarine:\nLiquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin, Mono and Diglycerides, Sodium\nBenzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN. \nBISCUIT (REGULAR): \nIngredients:  Enriched Flour (Bleached Wheat Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Cultured Nonfat Buttermilk, Vegetable Oil\n(Palm Oil, Palm Kernel Oil), Water, Leavening (Baking Soda, Sodium Aluminum Phosphate, Monocalcium Phosphate), Contains 2% Or Less: Salt, Sugar, Modified\nCellulose, Wheat Protein Isolate, Natural Flavor (Dairy and Vegetable Source), Soy Lecithin. \nCONTAINS: WHEAT, MILK AND SOY LECITHIN. \nPrepared with Liquid Margarine:\nLiquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin, Mono and Diglycerides, Sodium\nBenzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN. \nBLUEBERRIES (for Parfait): \nBlueberries\nBREAKFAST SAUCE: \nIngredients: Soybean Oil, Water, Egg Yolks, Egg Whites, Distilled Vinegar, Contains Less Than 2% of:  Salt, Corn Syrup Solids, Sugar, Lemon Juice Concentrate,\nModified Food Starch, Spice, Natural (Dairy and Plant Sources) and Artificial Flavors, Dehydrated Cheddar Cheese (Cultured Milk, Salt, Enzymes), Buttermilk\nPowder, Whey Powder, Disodium Inosinate, Disodium Guanylate, Propylene Glycol Alginate, Sodium Benzoate and Potassium Sorbate (Preservatives), Xanthan\nGum, Extractives of Turmeric (Color), Butter Oil, Butter Fat, Calcium Disodium EDTA Added To Protect Flavor. \nCONTAINS: EGG, MILK. \nBREAKFAST STEAK PATTIE: \nIngredients: Beef, Water, Salt, Sodium Phosphate, Natural Flavor (Plant Source).  Seasoned with Salt, Spices, Garlic, Partially Hydrogenated Soybean Oil, Natural\nFlavor (Plant Source).\nCANADIAN STYLE BACON: \nIngredients: Pork, Water, Sugar, Salt, Sodium Lactate, Sodium Phosphate, Natural Flavor, Sodium Diacetate And Sodium Nitrite (Preservatives).\nCARAMELIZED GRILLED ONIONS: \nIngredients:  Slivered Onions Prepared in Onion Reduction Sauce (Palm, Soybean and/or Cottonseed Oil, Salt, Sugar, Caramelized Sugar, Onion Powder,\nMaltodextrin, Natural Flavors [Plant Source], Spice).\nCRANBERRY RAISIN BLEND: \nIngredients: Sweetened Dried Cranberries (Sugar, Cranberries), California Raisins, Golden Raisins, Sunflower Oil, Sulfur Dioxide as a Preservative (Contains\nSulfites).\nDICED APPLES: \nIngredients:  Apples, Calcium Ascorbate (A Blend of Calcium and Vitamin C to Maintain Color).\nEGG: \nIngredients: USDA Grade A Eggs. \nCONTAINS: EGG. \nPrepared with Liquid Margarine: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin,\nMono and Diglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN. \nEGG WHITES: \nIngredients: Egg Whites.\nPrepared with Liquid Margarine: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin,\nMono-and Diglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: EGGS, SOY LECITHIN. \nENGLISH MUFFIN WITH 8 g WHOLE GRAIN: \nIngredients: Enriched Bleached Flour (Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamine Mononitrate, Riboflavin, Folic Acid), Water, Whole Wheat\nFlour, Yeast, Maltodextrin, Cornmeal, Contains 2% Or Less: High Fructose Corn Syrup, Wheat Gluten, Soybean Oil, Salt, Calcium Sulfate, Calcium Propionate\n(Preservative), Natural Flavor (Plant Source), Dough Conditioners (DATEM, Ascorbic Acid, Azodicarbonamide, Mono- and Tricalcium Phosphate, Enzymes), Calcium\nCitrate, Citric Acid, Wheat Starch, Torula Yeast, Caramel Color, Sorbitan Monostearate. \nCONTAINS: WHEAT. \nFLOUR TORTILLA: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, Shortening\n(Interesterified Soybean Oil and/or Hydrogenated Soybean Oil and/or Soybean Oil and/or Hydrogenated Cottonseed Oil), Contains 2% or Less of: Sugar, Leavening\n(May Contain One or More of: Baking Soda, Sodium Aluminum Sulfate, Corn Starch, Sodium Acid Pyrophosphate, Calcium Sulfate, Monocalcium Phosphate), Salt,\nWheat Gluten, Dough Conditioners (Sodium Metabisulfite [Contains Sulfites], Distilled Monoglycerides). \nCONTAINS: WHEAT. \nFOLDED EGG: \nIngredients: Pasteurized Whole Eggs, Modified Food Starch, Soybean Oil, Natural Flavors (Plant Source), Sodium Acid Pyrophosphate, Carrageenan, Flavor\nEnhancer (Salt, Maltodextrin, Natural Flavor [Plant Source], Spices, Herb, Turmeric [Color]), Monosodium Phosphate, Citric Acid, Soy Lecithin. \nCONTAINS: EGG, SOY LECITHIN. \nPrepared with Liquid Margarine: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin,\nMono and Diglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN. \nGRIDDLE CAKES: \nIngredients: Water, Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Sugar, Dextrose,\nPalm Oil, Contains 2% Or Less: Leavening (Baking Soda, Sodium Acid Pyrophosphate, Monocalcium Phosphate), Brown Sugar, Soybean Oil, Rice Flour, Whey,\nSalt, Modified Tapioca Starch, Buttermilk Powder, Caramel Color, Natural (Dairy And Plant Sources) And Artificial Flavors, Soy Lecithin, Corn Oil (Processing Aid). \nCONTAINS: WHEAT, MILK AND SOY. \nHASH BROWNS: \nIngredients: Potatoes, Vegetable Oil (Canola Oil, Hydrogenated Soybean Oil, Natural Beef Flavor [Wheat and Milk Derivatives]*, Citric Acid [Preservative]), Salt, Corn\nFlour, Dehydrated Potato, Dextrose, Sodium Acid Pyrophosphate (Maintain Color), Extractives of Black Pepper. \nCONTAINS: WHEAT AND MILK. \n*Natural beef flavor contains hydrolyzed wheat and hydrolyzed milk as starting ingredients.\n \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid Added to Preserve Freshness).\nDimethylpolysiloxane Added as an Antifoaming Agent\nHOTCAKES (3): \nIngredients: Water, Enriched Flour (Wheat Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Whey, Yellow Corn Flour, Soybean Oil, Sugar,\nEggs, Contains 2% Or Less: Leavening (Baking Soda, Sodium Aluminum Phosphate, Monocalcium Phosphate), Dextrose, Egg Whites, Emulsifier (Mono and\nDiglycerides, Propylene Glycol Monoester, Sodium Stearoyl Lactylate), Salt, Artificial Flavor, Xanthan Gum, Beta Carotene (Color), Soy Lecithin (Processing Aid). \nCONTAINS: WHEAT, MILK, EGG AND SOY LECITHIN. \nLIGHT CREAM: \nIngredients: Milk, Cream, Sodium Phosphate, DATEM, Sodium Stearoyl Lactylate, Sodium Citrate, Carrageenan. \nCONTAINS: MILK. \nLIQUID MARGARINE: \nIngredients: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin, Mono and\nDiglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN. \nLOW FAT CRUNCHY GRANOLA: \nIngredients: Whole Grain Rolled Oats, Brown Sugar, Crisp Rice (Rice Flour, Barley Malt Extract, Salt), Sunflower Oil, Salt, Baking Soda, Citric Acid, Crushed\nOranges, Cinnamon, Natural Flavor (Vegetable Source).\nMAY CONTAIN SOY AND WHEAT.\nLOWFAT YOGURT (for Parfaits): \nIngredients:  Cultured Pasteurized Grade A Reduced Fat Milk, Sugar, Modified Food Starch, Fructose, Whey Protein Concentrate, Corn Starch, Gelatin, Natural\n(Plant Source) and Artificial Flavor, Potassium Sorbate (Added to Maintain Freshness). \nCONTAINS: MILK. \nOATMEAL: \nIngredients: Water, Whole Grain Rolled Oats, Brown Sugar, Modified Food Starch, Salt, Natural Flavor (Plant Source), Barley Malt Extract, Caramel Color.\nOATMEAL without Brown Sugar: \nIngredients: Water, Whole Grain Rolled Oats, Modified Food Starch, Maltodextrin, Natural Flavor (Plant Source), Barley Malt Extract, Caramel Color, Salt.\nPASTEURIZED PROCESS AMERICAN CHEESE: \nIngredients: Milk, Cream, Water, Cheese Culture, Sodium Citrate, Contains 2% or Less of:  Salt, Citric Acid, Sodium Phosphate, Sorbic Acid (Preservative), Lactic\nAcid, Acetic Acid, Enzymes, Sodium Pyrophosphate, Natural Flavor (Dairy Source), Color Added, Soy Lecithin (Added for Slice Separation). \nCONTAINS: MILK AND SOY LECITHIN. \nPASTEURIZED PROCESS WHITE CHEDDAR CHEESE: \nIngredients: Milk, Water, Cheese Culture, Cream, Sodium Citrate, Contains 2% or less of: Salt, Citric Acid, Sorbic Acid (Preservative), May Contain One or More of:\nSodium Phosphate, Sodium Pyrophosphate, Sodium Hexametaphosphate, Enzymes, Acetic Acid, Soy Lecithin (Added for Slice Separation). \nCONTAINS: MILK AND SOY LECITHIN. \nSAUSAGE & SCRAMBLED EGG MIX: \nIngredients: Pre-Cooked Egg Product (Whole Eggs, Nonfat Milk, Soybean Oil, Modified Food Starch, Salt, Black Pepper Flavor [Corn Starch, Spices, Mixed\nTriglycerides, Flavors, Silicon Dioxide, Gelatin, Carboxymethyl Cellulose, Sodium Benzoate, Citric Acid, Gum Acacia], Extractives of Black Pepper, Xanthan Gum,\nCitric Acid, Butter {Cream}, Lipolized Butter Oil, Flavors, Artificial Flavors]), Pre-Cooked Sausage Crumbles (Pork, Water, Salt, Dextrose, Spices, Corn Syrup Solids,\nSugar, BHA, Propyl Gallate, Citric Acid [Added To Help Protect Flavor]), Vegetables (Tomatoes, Green Chiles, Onions, Calcium Chloride, Citric Acid). \nCONTAINS: EGG, MILK. \nSAUSAGE PATTY: \nIngredients:  Pork, Water, Seasoning (Salt, Corn Syrup Solids, Spices, Dextrose, Sugar, Spice Extractives), Preservatives (BHA, Citric Acid and Propyl Gallate).\nSCRAMBLED EGGS: \nIngredients: Pasteurized Whole Eggs with Sodium Acid Pyrophosphate, Citric Acid and Monosodium Phosphate (Added to Preserve Color), Nisin Preparation\n(Preservative). Prepared with Liquid Margarine: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil,\nSalt, Soy Lecithin, Mono-and Diglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene\n(Color). \nCONTAINS: EGG, SOY LECITHIN. \nSOUTHERN STYLE CRISPY BREAKFAST CHICKEN BREAST FIL: \nIngredients: Chicken Breast with Rib Meat, Water, Sugar, Salt, Modified Tapioca Starch, Spice, Yeast Extract, Sodium Phosphates, Carrageenan, Maltodextrin,\nNatural (Plant Source) and Artificial Flavors, Gum Arabic, Sunflower Lecithin. Battered and Breaded with: Wheat Flour, Water, Sugar, Salt, Modified Food Starch,\nYellow Corn Flour, Leavening (Baking Soda, Sodium Aluminum Phosphate, Sodium Acid Pyrophosphate, Monocalcium Phosphate), Wheat Gluten, Spice, Gum\nArabic, Natural Flavors (Plant Source), Extractives of Paprika. \nCONTAINS: WHEAT. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness).\nDimethylpolysiloxane added as an antifoaming agent.\nSTRAWBERRIES: \nIngredients: Strawberries, Konjac Flour.\nTHICK CUT APPLEWOOD SMOKED BACON: \nIngredients: Pork Bellies Cured with Water, Salt, Sugar, Natural Smoke Flavor (Plant Source), Sodium Phosphate, Sodium Erythorbate, Sodium Nitrite.\n \nSalads\nPremium Bacon Ranch Salad (without chicken): \nSALAD MIX, GRAPE TOMATOES, SHREDDED CHEDDAR/JACK CHEESE, BACON BITS\nPremium Bacon Ranch Salad with Crispy Chicken: \nCRISPY CHICKEN FILLET, SALAD MIX, GRAPE TOMATOES, SHREDDED CHEDDAR/JACK CHEESE, BACON BITS\nPremium Bacon Ranch Salad with Grilled Chicken: \nGRILLED CHICKEN FILLET, SALAD MIX, GRAPE TOMATOES, SHREDDED CHEDDAR/JACK CHEESE, BACON BITS\nPremium Southwest Salad (without chicken): \nSALAD MIX, SOUTHWEST VEGETABLE BLEND, SHREDDED CHEDDAR/JACK CHEESE, CHILI LIME TORTILLA STRIPS, LIME\nPremium Southwest Salad with Crispy Chicken: \nCRISPY CHICKEN FILLET, SALAD MIX, SOUTHWEST VEGETABLE BLEND, CILANTRO LIME GLAZE, SHREDDED CHEDDAR/JACK CHEESE, CHILI LIME\nTORTILLA STRIPS, LIME\nPremium Southwest Salad with Grilled Chicken: \nGRILLED CHICKEN FILLET, SALAD MIX, SOUTHWEST VEGETABLE BLEND, SHREDDED CHEDDAR/JACK CHEESE, CILANTRO LIME GLAZE, CHILI LIME\nTORTILLA STRIPS, LIME\nSide Salad: \nSIDE SALAD\nBACON BITS: \nIngredients:  Pork Bellies Cured with Water, Salt, Sugar, Natural Smoke Flavor (Plant Source), Sodium Phosphate, Sodium Erythorbate, Sodium Nitrite.\nCHILI LIME TORTILLA STRIPS: \nIngredients:  Corn, Vegetable Oil (Corn, Soybean and Sunflower Oil), Salt, Maltodextrin, Sugar, Dried Tomato, Dextrose, Spices, Onion Powder, Green Bell Pepper\nPowder, Citric Acid, Autolyzed Yeast Extract, Malic Acid, Paprika Extract (Color), Disodium Inosinate, Disodium Guanylate, Natural Flavor (Plant Source), Lemon\nExtract, Spice Extractive.\nCILANTRO LIME GLAZE: \nIngredients: Water, Corn Syrup Solids, High Fructose Corn Syrup, Sugar, Distilled Vinegar, Olive Oil, Soybean Oil, Freeze-Dried Orange Juice Concentrate, Cilantro,\nSalt, Freeze-Dried Lime Juice Concentrate, Xanthan Gum, Sodium Benzoate and Potassium Sorbate (Preservatives), Garlic Powder, Propylene Glycol Alginate,\nSpice, Onion Powder, Citric Acid.\nCRISPY CHICKEN FILLET: \nIngredients: Chicken Breast Fillet with Rib Meat, Water, Seasoning (Sugar, Salt, Sodium Phosphates, Modified Tapioca Starch, Spice, Autolyzed Yeast Extract,\nCarrageenan, Natural [Vegetable and Botanical Source] and Artificial Flavors, Maltodextrin, Sunflower Lecithin, Gum Arabic). Battered and Breaded with: Bleached\nWheat Flour, Water, Wheat Flour, Sugar, Salt, Modified Food Starch, Yellow Corn Flour, Leavening (Sodium Acid Pyrophosphate, Baking Soda, Sodium Aluminum\nPhosphate, Monocalcium Phosphate, Ammonium Bicarbonate), Wheat Gluten, Spices, Corn Starch, Dextrose, Xanthan Gum, Extractives of Paprika. \nCONTAINS: WHEAT. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness).\nDimethylpolysiloxane added as an antifoaming agent.\nGRAPE TOMATOES:\nGRILLED CHICKEN FILLET: \nIngredients: Chicken Breast Fillet with Rib Meat, Water, Seasoning (Rice Starch, Salt, Sugar, Yeast Extract, Canola Oil, Onion Powder, Maltodextrin, Chicken Skin,\nPaprika, Flavor, Sunflower Oil, Chicken, Garlic Powder, Chicken Fat, Spices), Sodium Phosphates.\n \nPrepared with Liquid Margarine: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin,\nMono-and Diglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN\nPrepared with Liquid Margarine: Liquid soybean oil and hydrogenated cottonseed and soybean oils, water, partially hydrogenated soybean oil, salt, soy\nlecithin, mono-and diglycerides, sodium benzoate and potassium sorbate (preservatives), artificial flavor, citric acid, vitamin A palmitate, beta carotene\n(color). \n \nCONTAINS: SOY LECITHIN. \nLIME: \nIngredients: Lime\nSALAD MIX: \nIngredients: Iceberg Lettuce, Romaine Lettuce, Spring Mix (May Contain Baby Red Romaine, Baby Green Romaine, Baby Red Leaf, Baby Green Leaf, Baby Red\nSwiss Chard, Baby Red Oak, Baby Green Oak, Parella, Lolla Rosa, Tango, Totsoi, Arugula, Mizuna, Radicchio, Frisee), Carrots.\n \nCURRENTLY, OUR SALADS DO NOT CONTAIN SPINACH.\nSHREDDED CHEDDAR/JACK CHEESE: \nIngredients: Cheddar Cheese (Pasteurized Milk, Cheese Culture, Salt, Enzymes, Annatto [Color]), Monterey Jack Cheese (Pasteurized Milk, Cheese Culture, Salt,\nEnzymes), Potato Starch and Corn Starch and Powdered Cellulose (Prevent Caking), Dextrose, Enzymes, Natamycin (Natural Mold Inhibitor). \nCONTAINS: MILK. \nSIDE SALAD: \nIngredients: LETTUCE, GRAPE TOMATO, SPRING MIX : May contain some or all of the following Baby Whole Leaf Varieties: Baby Green Romaine, Baby Red\nRomaine, Baby Red Leaf, Baby Green Leaf, Baby Red Swiss Chard, Baby Red Oak, Baby Green Oak, Lolla Rosa, Tango, Tatsoi, Arugula, Mizuna, Frisee,\nRadicchio, CARROTS.\n \n \nSOUTHWEST VEGETABLE BLEND: \nIngredients:  Roasted Corn, Black Beans, Roasted Tomato, Poblano Pepper, Lime Juice (Water, Lime Juice Concentrate, Lime Oil), Cilantro.\nSnacks & Sides\nFrench Fries:\nApple Slices†: \nApples, Calcium Ascorbate (a blend of Calcium and Vitamin C to maintain freshness and color).\nSide Salad: \nSIDE SALAD\nFruit 'n Yogurt Parfait: \nLOWFAT YOGURT (for Parfaits), STRAWBERRIES, BLUEBERRIES (for Parfait), LOW FAT CRUNCHY GRANOLA\nMighty Wings (3 piece): \nMIGHTY WINGS\nChipotle BBQ Snack Wrap (Crispy): \nFLOUR TORTILLA, CRISPY CHICKEN FILLET, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, CHIPOTLE BBQ SAUCE\nChipotle BBQ Snack Wrap (Grilled): \nFLOUR TORTILLA, GRILLED CHICKEN FILLET, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, CHIPOTLE BBQ SAUCE\nHoney Mustard Snack Wrap (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, TANGY HONEY MUSTARD SAUCE\nHoney Mustard Snack Wrap (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, TANGY HONEY MUSTARD SAUCE\nRanch Snack Wrap® (Crispy): \nCRISPY CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, BUTTERMILK RANCH SAUCE, SHREDDED LETTUCE\nRanch Snack Wrap® (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, SHREDDED CHEDDAR/JACK CHEESE, SHREDDED LETTUCE, BUTTERMILK RANCH SAUCE\nMac Snack Wrap†: \n1/2 QUARTER POUND 100% BEEF PATTY*, FLOUR TORTILLA, SHREDDED LETTUCE, BIG MAC SAUCE, PICKLE SLICES, PASTEURIZED PROCESS\nAMERICAN CHEESE, ONIONS\nKids Fries: \nFRENCH FRIES\n1/2 QUARTER POUND 100% BEEF PATTY*: \nIngredients: 100% Pure USDA Inspected Beef; No Fillers, No Extenders.\nPrepared With Grill Seasoning (Salt, Black Pepper).\n*Based On The Weight Before Cooking 4 Oz. (113.4g)\nBLUEBERRIES (for Parfait): \nBlueberries\nBUTTERMILK RANCH SAUCE: \nIngredients:  Soybean Oil, Cultured Buttermilk, Water, Sour Cream (Milk, Cultured Cream, Modified Food Starch, Guar Gum, Sodium Phosphates, Carob Bean Gum,\nSodium Citrate, Calcium Sulfate, Carrageenan, Dextrose, Potassium Sorbate, Citric Acid, Gelatin, Mono- and Diglycerides), Egg Yolks, Contains 2% or Less: Distilled\nVinegar, Maltodextrin, Salt, Dextrose, Modified Food Starch, Soy Sauce (Soybeans, Wheat, Salt), Dried Onion, Garlic Powder, Lactic Acid, Natural (Plant and Dairy\nSources) and Artificial Flavors, Shallots, Preservatives (Sodium Benzoate, Potassium Sorbate, Calcium Disodium EDTA), Xanthan Gum, Spice, Phosphoric Acid,\nSodium Acid Sulfate, Propylene Glycol Alginate, Autolyzed Yeast Extract. \nCONTAINS: MILK, EGG, SOY, WHEAT. \nBig Mac\u0000 Sauce: \nIngredients: Soybean Oil, Pickle Relish (Diced Pickles, High Fructose Corn Syrup, Sugar, Vinegar, Corn Syrup, Salt, Calcium Chloride, Xanthan Gum, Potassium\nSorbate [Preservative], Spice Extractives, Polysorbate 80), Distilled Vinegar, Water, Egg Yolks, High Fructose Corn Syrup, Onion Powder, Mustard Seed, Salt,\nSpices, Propylene Glycol Alginate, Sodium Benzoate (Preservative), Mustard Bran, Sugar, Garlic Powder, Vegetable Protein (Hydrolyzed Corn, Soy and Wheat),\nCaramel Color, Extractives of Paprika, Soy Lecithin, Turmeric (Color), Calcium Disodium EDTA (Protect Flavor). \nCONTAINS: WHEAT, EGG AND SOY. \nCHIPOTLE BBQ SAUCE: \nIngredients: High Fructose Corn Syrup, Water, Tomato Paste, Honey, Distilled Vinegar, Molasses, Modified Food Starch, Natural (Plant Source) and Artificial Flavors,\nSalt, Dried Chipotle Peppers, Natural Smoke Flavor (Plant Source), Dried Chili Peppers, Soybean Oil, Sodium Benzoate and Potassium Sorbate (Preservatives),\nOnion Powder, Garlic Powder, Caramel Color, Propylene Glycol Alginate, Spice.\nCRISPY CHICKEN FILLET: \nIngredients: Chicken Breast Fillet with Rib Meat, Water, Seasoning (Sugar, Salt, Sodium Phosphates, Modified Tapioca Starch, Spice, Autolyzed Yeast Extract,\nCarrageenan, Natural [Vegetable and Botanical Source] and Artificial Flavors, Maltodextrin, Sunflower Lecithin, Gum Arabic). Battered and Breaded with: Bleached\nWheat Flour, Water, Wheat Flour, Sugar, Salt, Modified Food Starch, Yellow Corn Flour, Leavening (Sodium Acid Pyrophosphate, Baking Soda, Sodium Aluminum\nPhosphate, Monocalcium Phosphate, Ammonium Bicarbonate), Wheat Gluten, Spices, Corn Starch, Dextrose, Xanthan Gum, Extractives of Paprika. \nCONTAINS: WHEAT. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness).\nDimethylpolysiloxane added as an antifoaming agent.\nFLOUR TORTILLA: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, Shortening\n(Interesterified Soybean Oil and/or Hydrogenated Soybean Oil and/or Soybean Oil and/or Hydrogenated Cottonseed Oil), Contains 2% or Less of: Sugar, Leavening\n(May Contain One or More of: Baking Soda, Sodium Aluminum Sulfate, Corn Starch, Sodium Acid Pyrophosphate, Calcium Sulfate, Monocalcium Phosphate), Salt,\nWheat Gluten, Dough Conditioners (Sodium Metabisulfite [Contains Sulfites], Distilled Monoglycerides). \nCONTAINS: WHEAT. \nFRENCH FRIES: \nIngredients:  Potatoes, Vegetable Oil (Canola Oil, Soybean Oil, Hydrogenated Soybean Oil, Natural Beef Flavor [Wheat and Milk Derivatives]*, Citric Acid\n[Preservative]), Dextrose, Sodium Acid Pyrophosphate (Maintain Color), Salt.  Prepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean\nOil with TBHQ and Citric Acid added to preserve freshness), Dimethylpolysiloxane added as an antifoaming agent.\n* \nCONTAINS: WHEAT AND MILK. \n*Natural beef flavor contains hydrolyzed wheat and hydrolyzed milk as starting ingredients.\nGRILLED CHICKEN FILLET: \nIngredients: Chicken Breast Fillet with Rib Meat, Water, Seasoning (Rice Starch, Salt, Sugar, Yeast Extract, Canola Oil, Onion Powder, Maltodextrin, Chicken Skin,\nPaprika, Flavor, Sunflower Oil, Chicken, Garlic Powder, Chicken Fat, Spices), Sodium Phosphates.\n \nPrepared with Liquid Margarine: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin,\nMono-and Diglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN\nPrepared with Liquid Margarine: Liquid soybean oil and hydrogenated cottonseed and soybean oils, water, partially hydrogenated soybean oil, salt, soy\nlecithin, mono-and diglycerides, sodium benzoate and potassium sorbate (preservatives), artificial flavor, citric acid, vitamin A palmitate, beta carotene\n(color). \n \nCONTAINS: SOY LECITHIN. \nLOW FAT CRUNCHY GRANOLA: \nIngredients: Whole Grain Rolled Oats, Brown Sugar, Crisp Rice (Rice Flour, Barley Malt Extract, Salt), Sunflower Oil, Salt, Baking Soda, Citric Acid, Crushed\nOranges, Cinnamon, Natural Flavor (Vegetable Source).\nMAY CONTAIN SOY AND WHEAT.\nLOWFAT YOGURT (for Parfaits): \nIngredients:  Cultured Pasteurized Grade A Reduced Fat Milk, Sugar, Modified Food Starch, Fructose, Whey Protein Concentrate, Corn Starch, Gelatin, Natural\n(Plant Source) and Artificial Flavor, Potassium Sorbate (Added to Maintain Freshness). \nCONTAINS: MILK. \nMIGHTY WINGS: \nIngredients: Chicken Wing Sections, Water, Salt, Rice Starch, Sodium Phosphates, Spice Extractives, Maltodextrin, Extractives of Garlic and Onion.  Battered and\nBreaded with: Water, Bleached Wheat Flour, Wheat Flour, Modified Food Starch, Yellow Corn Flour, Wheat Gluten, Salt, Leavening (Sodium Acid Pyrophosphate,\nSodium Bicarbonate), Rice Flour, Spices, Spice Extractives, Extractives of Paprika, Sugar, Onion Powder, Yeast, Xanthan Gum. \nCONTAINS: WHEAT. \nPrepared in vegetable oil (canola oil, corn oil, soybean oil, hydrogenated soybean oil with TBHQ and citric acid added to preserve freshness).  Dimethylpolysiloxane\nadded as an antifoaming agent.\nONIONS:\nPASTEURIZED PROCESS AMERICAN CHEESE: \nIngredients: Milk, Cream, Water, Cheese Culture, Sodium Citrate, Contains 2% or Less of:  Salt, Citric Acid, Sodium Phosphate, Sorbic Acid (Preservative), Lactic\nAcid, Acetic Acid, Enzymes, Sodium Pyrophosphate, Natural Flavor (Dairy Source), Color Added, Soy Lecithin (Added for Slice Separation). \nCONTAINS: MILK AND SOY LECITHIN. \nPICKLE SLICES: \nIngredients: Cucumbers, Water, Distilled Vinegar, Salt, Calcium Chloride, Alum, Potassium Sorbate (Preservative), Natural Flavors (Plant Source), Polysorbate 80,\nExtractives of Turmeric (Color).\nSHREDDED CHEDDAR/JACK CHEESE: \nIngredients: Cheddar Cheese (Pasteurized Milk, Cheese Culture, Salt, Enzymes, Annatto [Color]), Monterey Jack Cheese (Pasteurized Milk, Cheese Culture, Salt,\nEnzymes), Potato Starch and Corn Starch and Powdered Cellulose (Prevent Caking), Dextrose, Enzymes, Natamycin (Natural Mold Inhibitor). \nCONTAINS: MILK. \nSHREDDED LETTUCE:\nSIDE SALAD: \nIngredients: LETTUCE, GRAPE TOMATO, SPRING MIX : May contain some or all of the following Baby Whole Leaf Varieties: Baby Green Romaine, Baby Red\nRomaine, Baby Red Leaf, Baby Green Leaf, Baby Red Swiss Chard, Baby Red Oak, Baby Green Oak, Lolla Rosa, Tango, Tatsoi, Arugula, Mizuna, Frisee,\nRadicchio, CARROTS.\n \n \nSTRAWBERRIES: \nIngredients: Strawberries, Konjac Flour.\nTANGY HONEY MUSTARD SAUCE: \nIngredients:  Water, Sugar, Dijon Mustard (Distilled Vinegar, Mustard Seed, Salt, Water, White Wine, Spices), Corn Syrup Solids, Honey, Soybean Oil, Distilled\nVinegar, Modified Food Starch, Egg Yolks, Mustard (Water, Distilled Vinegar, Mustard Seed, Salt, Turmeric [Color], Paprika, Spice), Xanthan Gum, Salt, Titanium\nDioxide (Color), Propylene Glycol Alginate, Sodium Benzoate (Preservative), Spice, Yellow 5, Yellow 6. \nCONTAINS: EGG. \n\nBeverages\n1% Low Fat Milk Jug: \nLow fat milk, vitamin A palmitate, vitamin D3. Contains 25% of the Daily Value of vitamin D.\nFat Free Chocolate Milk Jug†: \nNonfat milk, sugar, fructose, cocoa, cocoa (processed with alkali), natural flavor, salt, carrageenan, vitamin A palmitate, vitamin D3. \nCONTAINS: MILK.\nMinute Maid® 100%  Apple Juice Box: \nFiltered water, concentrated apple juice, less than 0.5% of: calcium citrate, ascorbic acid (vitamin C).\nOrange Juice: \nMinute Maid® 100% Orange Juice\nFiltered water, orange juice concentrate.\nDasani® Water: \nPurified water, magnesium sulfate, potassium chloride, salt.*\n  *Adds a negligible amount of sodium.  Minerals added for taste.  Purified by reverse osmosis.\nCoca-Cola\u0000 Classic: \nCarbonated water, high fructose corn syrup, caramel color, phosphoric acid, natural flavors (vegetable source), caffeine.\nDiet Coke\u0000: \nCarbonated water, caramel color, phosphoric acid, sodium saccharin, natural flavors (vegetable source), citric acid, potassium citrate, potassium benzoate (to protect\ntaste), caffeine, aspartame, dimethylpolysiloxane (antifoaming agent).  PHENYLKETONURICS: ASPARTAME CONTAINS PHENYLALANINE\nDr Pepper® (Small): \nCarbonated water, high fructose corn syrup, caramel color, phosphoric acid, caffeine, sodium benzoate (preservative), natural (vegetable source) and artificial flavors,\ndimethylpolysiloxane (antifoaming agent).\nDiet Dr Pepper® (Small): \nCarbonated water, caramel color, phosphoric acid, aspartame, sodium citrate, sodium benzoate (preservative), caffeine, acesulfame potassium, sucralose, natural\n(vegetable source) and artificial flavors, dimethylpolysiloxane (antifoaming agent).\nPHENYLKETONURICS: ASPARTAME CONTAINS PHENYLALANINE\nSprite\u0000: \nCarbonated water, high fructose corn syrup, citric acid, natural flavors (vegetable source), sodium citrate, sodium benzoate (to protect taste), dimethylpolysiloxane\n(antifoaming agent).\nHi-C\u0000 Orange Lavaburst: \nWater, high fructose corn syrup, citric acid, ascorbic acid (vitamin C), potassium benzoate (to protect taste), modified food starch, natural flavors (vegetable source),\nglycerol ester of wood rosin, yellow 6, brominated vegetable oil, red 40.\nPOWERade\u0000 Mountain Blast: \nWater, high fructose corn syrup, citric acid, natural flavors (vegetable source), salt, potassium citrate, potassium benzoate and potassium sorbate (to protect taste),\nmodified food starch, coconut oil, potassium phosphate, sucrose acetate isobutyrate, niacinamide (vitamin B3), blue 1, pyridoxine hydrochloride (vitamin B6),\ncyanocobalamin (vitamin B12).\nIced Tea: \nICED TEA  (Small)\nSweet Tea (Small): \nWater, sugar, orange pekoe and pekoe cut black tea.\nCoffee (Small): \nCOFFEE (Small)\nFrappe Mocha (Small): \nMOCHA COFFEE FRAPPE BASE, ICE, WHIPPED CREAM, CHOCOLATE DRIZZLE\nFrappe Caramel (Small): \nCARAMEL COFFEE FRAPPE BASE, ICE, WHIPPED CREAM, CARAMEL DRIZZLE\nFrappe Chocolate Chip (Small)†: \nICE, CARAMEL COFFEE FRAPPE BASE, MOCHA COFFEE FRAPPE BASE, WHIPPED CREAM, CHOCOLATE CHIPS, CARAMEL DRIZZLE, CHOCOLATE\nDRIZZLE\nBlueberry Pomegranate Smoothie (Small): \nBLUEBERRY POMEGRANATE SMOOTHIE BASE, ICE, LOWFAT SMOOTHIE YOGURT\nStrawberry Banana Smoothie (Small): \nSTRAWBERRY BANANA FRUIT BASE, LOWFAT SMOOTHIE YOGURT, ICE\nMango Pineapple Smoothie (Small): \nMANGO PINEAPPLE FRUIT BASE, ICE, LOWFAT SMOOTHIE YOGURT\nVanilla McCafé Shake (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, VANILLA SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nChocolate McCafé Shake (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, CHOCOLATE SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nStrawberry McCafé Shake (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, STRAWBERRY SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nIced Coffee-- Caramel: \nICE, PREMIUM ROAST COFFEE, CARAMEL SYRUP, LIGHT CREAM\nIced Coffee-- French Vanilla (Small): \nPREMIUM ROAST COFFEE, ICE, FRENCH VANILLA SYRUP, LIGHT CREAM\nIced Coffee-- Hazelnut: \nICE, PREMIUM ROAST COFFEE, HAZELNUT SYRUP, LIGHT CREAM\nIced Coffee-- Regular (Small): \nICE, PREMIUM ROAST COFFEE, LIQUID SUGAR, LIGHT CREAM\nSweet Tea (Medium): \nWater, sugar, orange pekoe and pekoe cut black tea.\nCoffee (Large): \nCOFFEE (Large)\nCoffee (Medium): \nCOFFEE (Medium)\nDiet Dr Pepper® (Child): \nCarbonated water, caramel color, phosphoric acid, aspartame, sodium citrate, sodium benzoate (preservative), caffeine, acesulfame potassium, sucralose, natural\n(vegetable source) and artificial flavors, dimethylpolysiloxane (antifoaming agent).\nPHENYLKETONURICS: ASPARTAME CONTAINS PHENYLALANINE\nDiet Dr Pepper® (Large): \nCarbonated water, caramel color, phosphoric acid, aspartame, sodium citrate, sodium benzoate (preservative), caffeine, acesulfame potassium, sucralose, natural\n(vegetable source) and artificial flavors, dimethylpolysiloxane (antifoaming agent).\nPHENYLKETONURICS: ASPARTAME CONTAINS PHENYLALANINE\nDiet Dr Pepper® (Medium): \nCarbonated water, caramel color, phosphoric acid, aspartame, sodium citrate, sodium benzoate (preservative), caffeine, acesulfame potassium, sucralose, natural\n(vegetable source) and artificial flavors, dimethylpolysiloxane (antifoaming agent).\nPHENYLKETONURICS: ASPARTAME CONTAINS PHENYLALANINE\nDr Pepper® (Child): \nCarbonated water, high fructose corn syrup, caramel color, phosphoric acid, caffeine, sodium benzoate (preservative), natural (vegetable source) and artificial flavors,\ndimethylpolysiloxane (antifoaming agent).\nDr Pepper® (Large): \nCarbonated water, high fructose corn syrup, caramel color, phosphoric acid, caffeine, sodium benzoate (preservative), natural (vegetable source) and artificial flavors,\ndimethylpolysiloxane (antifoaming agent).\nDr Pepper® (Medium): \nCarbonated water, high fructose corn syrup, caramel color, phosphoric acid, caffeine, sodium benzoate (preservative), natural (vegetable source) and artificial flavors,\ndimethylpolysiloxane (antifoaming agent).\nIced Coffee with Sugar Free French Vanilla Syrup (Large): \nICE, PREMIUM ROAST COFFEE, SUGAR FREE FRENCH VANILLA SYRUP, LIGHT CREAM\nIced Coffee with Sugar Free French Vanilla Syrup (Medium): \nPREMIUM ROAST COFFEE, ICE, LIGHT CREAM, SUGAR FREE FRENCH VANILLA SYRUP\nIced Coffee with Sugar Free French Vanilla Syrup (Small): \nICE, PREMIUM ROAST COFFEE, SUGAR FREE FRENCH VANILLA SYRUP, LIGHT CREAM\nIced Coffee-- French Vanilla (Large): \nICE, PREMIUM ROAST COFFEE, FRENCH VANILLA SYRUP, LIGHT CREAM\nIced Coffee-- French Vanilla (Medium): \nPREMIUM ROAST COFFEE, ICE, LIGHT CREAM, FRENCH VANILLA SYRUP\nIced Coffee-- Regular (Large): \nICE, PREMIUM ROAST COFFEE, LIQUID SUGAR, LIGHT CREAM\nIced Coffee-- Regular (Medium): \nPREMIUM ROAST COFFEE, ICE, LIGHT CREAM, LIQUID SUGAR\nSweet Tea (Child): \nWater, sugar, orange pekoe and pekoe cut black tea.\nSweet Tea (Large)†: \nWater, sugar, orange pekoe and pekoe cut black tea.\nBLUEBERRY POMEGRANATE SMOOTHIE BASE: \nIngredients: Blueberry Puree, Water, Clarified Demineralized Pineapple Juice Concentrate, Raspberry Puree, Apple Juice Concentrate, Pomegranate Juice\nConcentrate, Contains 1% or Less: Natural (Plant Source) and Artificial Flavors, Cellulose Powder, Peach Juice Concentrate, Pear Juice Concentrate, Citric Acid,\nLemon Juice Concentrate, Xanthan Gum, Pectin, Fruit and Vegetable Juice For Color. \nCONTAINS: MILK. \n*Dispensed from equipment that also dispenses milk ingredients (yogurt).\nCARAMEL COFFEE FRAPPE BASE: \nIngredients:  Water, Cream, Sugar, Milk, High Fructose Corn Syrup, Coffee Extract, Natural (Plant Source) and Artificial Flavors, Mono and Diglycerides, Guar Gum,\nPotassium Citrate, Disodium Phosphate, Carrageenan, Carob Bean Gum. \nCONTAINS: MILK. \nCARAMEL DRIZZLE: \nIngredients:  Corn Syrup, Sweetened Condensed Milk (Milk, Sugar) High Fructose Corn Syrup, Water, Butter, Sugar, Salt, Pectin, Disodium Phosphate, Artificial\nFlavors (Vanillin, Ethyl Vanillin), Caramel Color (with Sulfites), Potassium Sorbate (Preservative). \nCONTAINS: MILK. \nCARAMEL SYRUP: \nIngredients: Sugar, Water, Fructose, Natural (Plant Source) and Artificial Flavor, Salt, Caramel Color (with Sulfites), Potassium Sorbate (Preservative), Citric Acid,\nMalic Acid.\nCHOCOLATE CHIPS: \nIngredients:  Semi-Sweet Chocolate (Sugar, Chocolate, Cocoa Butter, Milkfat, Soy Lecithin, Vanillin [Artificial Flavor], Milk). \nCONTAINS: MILK, SOY LECITHIN. \nCHOCOLATE DRIZZLE: \nIngredients: Corn Syrup, Dextrose, Water, Sugar, Glycerin, Hydrogenated Coconut Oil, Cocoa (Processed with Alkali), Modified Food Starch, Nonfat Milk, Natural\n(Plant Source) and Artificial Flavor, Salt, Gellan Gum, Disodium Phosphate, Potassium Sorbate (Preservative), Soy Lecithin, Artificial Flavor (Vanillin). \nCONTAINS: MILK, SOY LECITHIN. \nCHOCOLATE SHAKE SYRUP: \nIngredients:  High Fructose Corn Syrup, Corn Syrup, Water, Cocoa (Processed with Alkali), Natural (Plant Source) and Artificial Flavors, Caramel Color, Salt,\nPotassium Sorbate (Preservative), Artificial Flavor (Vanillin), Red 40.\nMay contain small amounts of other shake flavors served at the restaurant, including egg ingredients when Egg Nog Shakes are available.\n \n \nCOFFEE (Large): \nIngredients: Brewed Coffee\nCOFFEE (Medium): \nIngredients: Brewed Coffee\nCOFFEE (Small): \nIngredients: Brewed Coffee\nFRENCH VANILLA SYRUP: \nIngredients: Sugar, Water, Natural (Plant Source) and Artificial Flavor, Potassium Sorbate and Sodium Benzoate (Preservatives), Citric Acid, Caramel Color (with\nSulfites).\nHAZELNUT SYRUP: \nIngredients:  Sugar, Water, Fructose, Natural (Plant Source) and Artificial Flavors, Potassium Sorbate (Preservative), Citric Acid, Caramel Color (with Sulfites), Malic\nAcid.\nICE: \nIngredients: ICE\nICED TEA  (Child): \nIngredients: Water, Orange Pekoe and Pekoe Cut Black Tea.\nICED TEA  (Small): \nIngredients: Water, Orange Pekoe and Pekoe Cut Black Tea.\nICED TEA (Large): \nIngredients: Water, Orange Pekoe and Pekoe Cut Black Tea.\nICED TEA (Medium): \nIngredients: Water, Orange Pekoe and Pekoe Cut Black Tea.\nLIGHT CREAM: \nIngredients: Milk, Cream, Sodium Phosphate, DATEM, Sodium Stearoyl Lactylate, Sodium Citrate, Carrageenan. \nCONTAINS: MILK. \nLIQUID SUGAR: \nIngredients:  Sugar, Water, Potassium Sorbate (Preservative), Citric Acid.\nLOWFAT SMOOTHIE YOGURT: \nCultured Grade A Reduced Fat Milk, Sugar, Whey Protein Concentrate, Fructose, Corn Starch, Modified Food Starch, Gelatin.  Contains Active Yogurt Cultures. \nCONTAINS: MILK. \nMANGO PINEAPPLE FRUIT BASE: \nIngredients: Water, Clarified Demineralized Pineapple Juice Concentrate, Mango Puree Concentrate, Pineapple Juice Concentrate, Orange Juice Concentrate,\nPineapple Puree, Passion Fruit Juice, Apple Juice Concentrate, Natural (Botanical Source) and Artificial Flavors, Contains less than 1% of the following: Peach\nPuree, Cellulose Powder, Pear Juice Concentrate, Xanthan Gum, Peach Juice Concentrate, Pectin, Citric Acid, Colored with Fruit and Vegetable Juice and Turmeric\nExtract, Ascorbic Acid (Preservative). \nCONTAINS: MILK. \n*Dispensed from equipment that also dispenses milk ingredients (yogurt).\nMARASCHINO CHERRY: \nIngredients: Cherries, Water, Corn Syrup, High Fructose Corn Syrup, Sugar, Malic Acid, Citric Acid, Natural (Plant Source) and Artificial Flavors, Sodium Benzoate\nand Potassium Sorbate (Preservatives), Red 40, Sulfur Dioxide as Preservative (Contains Sulfites).\nMOCHA COFFEE FRAPPE BASE: \nIngredients:  Water, Cream, Sugar, Milk, High Fructose Corn Syrup, Coffee Extract, Natural (Plant Source) and Artificial Flavors, Cocoa (Processed with Alkali), Mono\nand Diglycerides, Guar Gum, Potassium Citrate, Disodium Phosphate, Carrageenan, Carob Bean Gum, Colored with Red 40, Yellow 5, Blue 1. \nCONTAINS: MILK. \nPREMIUM ROAST COFFEE:\nSTRAWBERRY BANANA FRUIT BASE: \nIngredients: Strawberry Puree, Banana Puree, Water, Grape Juice Concentrate, Clarified Demineralized Pineapple Juice Concentrate, Sugar, Contains Less Than\n1%: Natural (Plant Source) and Artificial Flavors, Cellulose Powder, Pear Juice Concentrate, Peach Juice Concentrate, Xanthan Gum, Citric Acid, Pectin, Colored\nwith Fruit and Vegetable Juice, Ascorbic Acid (Preservative). \nCONTAINS: MILK. \n*Dispensed from equipment that also dispenses milk ingredients (yogurt)\nSTRAWBERRY SHAKE SYRUP: \nIngredients: Sugar, Water, Corn Syrup, Strawberries, High Fructose Corn Syrup, Natural (Botanical Source) and Artificial Flavor, Pectin, Citric Acid, Potassium\nSorbate (Preservative), Caramel Color, Calcium Chloride, Red 40.\nMay contain small amounts of other shake flavors served at the restaurant, including egg ingredients when Egg Nog Shakes are available.\nSUGAR FREE FRENCH VANILLA SYRUP: \nIngredients: Water, Eythritol, Natural (Plant Source) and Artificial Flavor, Cellulose Gum, Salt, Malic Acid, Potassium Sorbate (Preservative), Acesulfame Potassium,\nSucralose, Caramel Color.\nVANILLA REDUCED FAT ICE CREAM: \nIngredients:  Milk, Sugar, Cream, Nonfat Milk Solids, Corn Syrup Solids, Mono- and Diglycerides, Guar Gum, Dextrose, Sodium Citrate, Artificial Vanilla Flavor,\nSodium Phosphate, Carrageenan, Disodium Phosphate, Cellulose Gum, Vitamin A Palmitate. \nCONTAINS: MILK. \nVANILLA SHAKE SYRUP: \nIngredients: Corn Syrup, Water, Vanilla Extract, Caramel Color, Citric Acid, Pectin, Potassium Sorbate (Preservative), Yellow 5, Yellow 6.\n \nMay contain small amounts of other shake flavors served at the restaurant, including egg ingredients when Egg Nog Shakes are available.\nWHIPPED CREAM: \nIngredients:  Cream, Nonfat Milk, Corn Syrup, Sugar, High Fructose Corn Syrup, Contains Less Than 1%:  Mono-And Diglycerides, Carrageenan, Polysorbate 80,\nBeta Carotene (Color), Natural (Dairy and Plant Sources) and Artificial Flavor, Mixed Tocopherols (Vitamin E) to Protect Flavor.  Whipping Propellant (Nitrous Oxide). \nCONTAINS: MILK. \nMcCafe\nCoffee (Small): \nCOFFEE (Small)\nFrappe Mocha (Small): \nMOCHA COFFEE FRAPPE BASE, ICE, WHIPPED CREAM, CHOCOLATE DRIZZLE\nFrappe Caramel (Small): \nCARAMEL COFFEE FRAPPE BASE, ICE, WHIPPED CREAM, CARAMEL DRIZZLE\nFrappe Chocolate Chip (Small)†: \nICE, CARAMEL COFFEE FRAPPE BASE, MOCHA COFFEE FRAPPE BASE, WHIPPED CREAM, CHOCOLATE CHIPS, CARAMEL DRIZZLE, CHOCOLATE\nDRIZZLE\nBlueberry Pomegranate Smoothie (Small): \nBLUEBERRY POMEGRANATE SMOOTHIE BASE, ICE, LOWFAT SMOOTHIE YOGURT\nStrawberry Banana Smoothie (Small): \nSTRAWBERRY BANANA FRUIT BASE, LOWFAT SMOOTHIE YOGURT, ICE\nMango Pineapple Smoothie (Small): \nMANGO PINEAPPLE FRUIT BASE, ICE, LOWFAT SMOOTHIE YOGURT\nVanilla McCafé Shake (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, VANILLA SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nChocolate McCafé Shake (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, CHOCOLATE SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nStrawberry McCafé Shake (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, STRAWBERRY SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nChocolate McCafé Shake (16 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, CHOCOLATE SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nChocolate McCafé Shake (22 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, CHOCOLATE SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nCoffee (Large): \nCOFFEE (Large)\nFrappe Caramel (Large): \nCARAMEL COFFEE FRAPPE BASE, ICE, WHIPPED CREAM, CARAMEL DRIZZLE\nStrawberry McCafé Shake (16 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, STRAWBERRY SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nStrawberry McCafé Shake (22 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, STRAWBERRY SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nVanilla McCafé Shake (16 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, VANILLA SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nVanilla McCafé Shake (22 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, VANILLA SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nIced Mocha (Large): \nWHOLE MILK, ICE, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nIced Mocha (Small): \nWHOLE MILK, ICE, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nIced Mocha with Nonfat Milk (Large): \nNONFAT MILK, ICE, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nIced Mocha with Nonfat Milk (Small): \nNONFAT MILK, ICE, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nIced Coffee with Sugar Free French Vanilla Syrup (Large): \nICE, PREMIUM ROAST COFFEE, SUGAR FREE FRENCH VANILLA SYRUP, LIGHT CREAM\nIced Coffee with Sugar Free French Vanilla Syrup (Medium): \nPREMIUM ROAST COFFEE, ICE, LIGHT CREAM, SUGAR FREE FRENCH VANILLA SYRUP\nIced Coffee with Sugar Free French Vanilla Syrup (Small): \nICE, PREMIUM ROAST COFFEE, SUGAR FREE FRENCH VANILLA SYRUP, LIGHT CREAM\nIced Coffee-- Caramel: \nPREMIUM ROAST COFFEE, ICE, CARAMEL SYRUP, LIGHT CREAM\nIced Coffee-- French Vanilla (Large): \nICE, PREMIUM ROAST COFFEE, FRENCH VANILLA SYRUP, LIGHT CREAM\nIced Coffee-- French Vanilla (Medium): \nPREMIUM ROAST COFFEE, ICE, LIGHT CREAM, FRENCH VANILLA SYRUP\nIced Coffee-- French Vanilla (Small): \nPREMIUM ROAST COFFEE, ICE, FRENCH VANILLA SYRUP, LIGHT CREAM\nIced Coffee-- Hazelnut: \nICE, PREMIUM ROAST COFFEE, HAZELNUT SYRUP, LIGHT CREAM\nIced Coffee-- Regular (Large): \nICE, PREMIUM ROAST COFFEE, LIQUID SUGAR, LIGHT CREAM\nIced Coffee-- Regular (Medium): \nPREMIUM ROAST COFFEE, ICE, LIGHT CREAM, LIQUID SUGAR\nIced Coffee-- Regular (Small): \nICE, PREMIUM ROAST COFFEE, LIQUID SUGAR, LIGHT CREAM\nMocha (Small): \nWHOLE MILK, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nMocha (Medium): \nWHOLE MILK, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nMocha (Large): \nWHOLE MILK, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nMocha with Nonfat Milk (Small): \nNONFAT MILK, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nMocha with Nonfat Milk (Medium): \nNONFAT MILK, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nMocha with Nonfat Milk (Large): \nNONFAT MILK, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nCaramel Mocha (Small): \nWHOLE MILK, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nCaramel Mocha  (Medium): \nWHOLE MILK, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nCaramel Mocha (Large): \nWHOLE MILK, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nNonfat Caramel Mocha (Small): \nNONFAT MILK, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nNonfat Caramel Mocha (Medium): \nNONFAT MILK, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nNonfat Caramel Mocha (Large): \nNONFAT MILK, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nLatte (Small) : \nWHOLE MILK, ESPRESSO\nLatte (Medium): \nWHOLE MILK, ESPRESSO\nLatte (Large): \nWHOLE MILK, ESPRESSO\nCaramel Latte (Large): \nWHOLE MILK, ESPRESSO, CARAMEL SYRUP\nCaramel Latte (Medium): \nWHOLE MILK, ESPRESSO, CARAMEL SYRUP\nCaramel Latte (Small): \nWHOLE MILK, ESPRESSO, CARAMEL SYRUP\nHazelnut Latte (Small): \nWHOLE MILK, ESPRESSO, HAZELNUT SYRUP\nHazelnut Latte (Medium): \nWHOLE MILK, ESPRESSO, HAZELNUT SYRUP\nHazelnut Latte (Large): \nWHOLE MILK, ESPRESSO, HAZELNUT SYRUP\nFrench Vanilla Latte (Small): \nWHOLE MILK, ESPRESSO, FRENCH VANILLA SYRUP\nFrench Vanilla Latte (Medium): \nWHOLE MILK, ESPRESSO, FRENCH VANILLA SYRUP\nFrench Vanilla Latte (Large): \nWHOLE MILK, ESPRESSO, FRENCH VANILLA SYRUP\nLatte with Sugar Free French Vanilla Syrup (Small): \nWHOLE MILK, ESPRESSO, SUGAR FREE FRENCH VANILLA SYRUP\nLatte with Sugar Free French Vanilla Syrup (Medium): \nWHOLE MILK, ESPRESSO, SUGAR FREE FRENCH VANILLA SYRUP\nLatte with Sugar Free French Vanilla Syrup (Large): \nWHOLE MILK, ESPRESSO, SUGAR FREE FRENCH VANILLA SYRUP\nNonfat Latte (Small): \nNONFAT MILK, ESPRESSO\nNonfat Latte (Medium): \nNONFAT MILK, ESPRESSO\nNonfat Latte (Large): \nNONFAT MILK, ESPRESSO\nNonfat Caramel Latte (Small): \nNONFAT MILK, ESPRESSO, CARAMEL SYRUP\nNonfat Caramel Latte (Medium): \nNONFAT MILK, ESPRESSO, CARAMEL SYRUP\nNonfat Caramel Latte (Large): \nNONFAT MILK, ESPRESSO, CARAMEL SYRUP\nNonfat Hazelnut Latte (Small): \nNONFAT MILK, ESPRESSO, HAZELNUT SYRUP\nNonfat Hazelnut Latte (Medium): \nNONFAT MILK, ESPRESSO, HAZELNUT SYRUP\nNonfat Hazelnut Latte (Large): \nNONFAT MILK, ESPRESSO, HAZELNUT SYRUP\nNonfat French Vanilla Latte (Small): \nNONFAT MILK, ESPRESSO, FRENCH VANILLA SYRUP\nNonfat French Vanilla Latte (Medium): \nNONFAT MILK, ESPRESSO, FRENCH VANILLA SYRUP\nNonfat French Vanilla Latte (Large): \nNONFAT MILK, ESPRESSO, FRENCH VANILLA SYRUP\nNonfat Latte with Sugar Free French Vanilla Syrup (Small): \nNONFAT MILK, ESPRESSO, SUGAR FREE FRENCH VANILLA SYRUP\nNonfat Latte with Sugar Free French Vanilla Syrup (Medium): \nNONFAT MILK, ESPRESSO, SUGAR FREE FRENCH VANILLA SYRUP\nNonfat Latte with Sugar Free French Vanilla Syrup (Large): \nNONFAT MILK, ESPRESSO, SUGAR FREE FRENCH VANILLA SYRUP\nHot Chocolate (Small): \nWHOLE MILK, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nHot Chocolate (Medium): \nWHOLE MILK, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nHot Chocolate (Large): \nWHOLE MILK, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nHot Chocolate with Nonfat Milk (Small): \nNONFAT MILK, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nHot Chocolate with Nonfat Milk (Medium): \nNONFAT MILK, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nBlueberry Pomegranate Smoothie (Large): \nBLUEBERRY POMEGRANATE SMOOTHIE BASE, ICE, LOWFAT SMOOTHIE YOGURT\nBlueberry Pomegranate Smoothie (Medium): \nBLUEBERRY POMEGRANATE SMOOTHIE BASE, ICE, LOWFAT SMOOTHIE YOGURT\nCoffee (Medium): \nCOFFEE (Medium)\nEgg Nog McCafe Shake (16 fl oz cup) Medium†: \nVANILLA REDUCED FAT ICE CREAM, EGG NOG SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nEgg Nog McCafe Shake (22 fl oz cup) Large†: \nVANILLA REDUCED FAT ICE CREAM, EGG NOG SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nFrappe Chocolate Chip (Large): \nICE, CARAMEL COFFEE FRAPPE BASE, MOCHA COFFEE FRAPPE BASE, WHIPPED CREAM, CHOCOLATE CHIPS, CARAMEL DRIZZLE, CHOCOLATE\nDRIZZLE\nFrappe Chocolate Chip (Medium)†: \nICE, CARAMEL COFFEE FRAPPE BASE, MOCHA COFFEE FRAPPE BASE, WHIPPED CREAM, CHOCOLATE CHIPS, CARAMEL DRIZZLE, CHOCOLATE\nDRIZZLE\nHot Chocolate with Nonfat Milk (Large): \nNONFAT MILK, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nMango Pineapple Smoothie (Large): \nMANGO PINEAPPLE FRUIT BASE, ICE, LOWFAT SMOOTHIE YOGURT\nMango Pineapple Smoothie (Medium): \nMANGO PINEAPPLE FRUIT BASE, ICE, LOWFAT SMOOTHIE YOGURT\nMcCafé Caramel Hot Chocolate  with Nonfat Milk (Small): \nNONFAT MILK, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nMcCafé Caramel Hot Chocolate with Nonfat Milk (Large): \nNONFAT MILK, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nMcCafé Caramel Hot Chocolate with Nonfat Milk (Medium): \nNONFAT MILK, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nIced Mocha (Medium): \nWHOLE MILK, ICE, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nIced Mocha with Nonfat Milk (Medium): \nNONFAT MILK, ICE, ESPRESSO, CHOCOLATE SYRUP, WHIPPED CREAM, CHOCOLATE DRIZZLE\nIced Caramel Mocha (Small): \nWHOLE MILK, ICE, ESPRESSO, CHOCOLATE CARAMEL SYRUP, CARAMEL DRIZZLE, WHIPPED CREAM\nIced Caramel Mocha (Medium): \nWHOLE MILK, ESPRESSO, ICE, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nIced Caramel Mocha (Large): \nWHOLE MILK, ICE, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nIced Nonfat Caramel Mocha (Small): \nNONFAT MILK, ICE, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nIced Nonfat Caramel Mocha (Medium): \nNONFAT MILK, ICE, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nIced Nonfat Caramel Mocha (Large): \nNONFAT MILK, ICE, ESPRESSO, CHOCOLATE CARAMEL SYRUP, WHIPPED CREAM, CARAMEL DRIZZLE\nFrappe Mocha (Medium): \nMOCHA COFFEE FRAPPE BASE, ICE, WHIPPED CREAM, CHOCOLATE DRIZZLE\nFrappe Mocha (Large): \nMOCHA COFFEE FRAPPE BASE, ICE, WHIPPED CREAM, CHOCOLATE DRIZZLE\nFrappe Caramel (Medium): \nCARAMEL COFFEE FRAPPE BASE, ICE, WHIPPED CREAM, CARAMEL DRIZZLE\nStrawberry Banana Smoothie (Medium): \nSTRAWBERRY BANANA FRUIT BASE, LOWFAT SMOOTHIE YOGURT, ICE\nStrawberry Banana Smoothie (Large): \nSTRAWBERRY BANANA FRUIT BASE, LOWFAT SMOOTHIE YOGURT, ICE\nBLUEBERRY POMEGRANATE SMOOTHIE BASE: \nIngredients: Blueberry Puree, Water, Clarified Demineralized Pineapple Juice Concentrate, Raspberry Puree, Apple Juice Concentrate, Pomegranate Juice\nConcentrate, Contains 1% or Less: Natural (Plant Source) and Artificial Flavors, Cellulose Powder, Peach Juice Concentrate, Pear Juice Concentrate, Citric Acid,\nLemon Juice Concentrate, Xanthan Gum, Pectin, Fruit and Vegetable Juice For Color. \nCONTAINS: MILK. \n*Dispensed from equipment that also dispenses milk ingredients (yogurt).\nCARAMEL COFFEE FRAPPE BASE: \nIngredients:  Water, Cream, Sugar, Milk, High Fructose Corn Syrup, Coffee Extract, Natural (Plant Source) and Artificial Flavors, Mono and Diglycerides, Guar Gum,\nPotassium Citrate, Disodium Phosphate, Carrageenan, Carob Bean Gum. \nCONTAINS: MILK. \nCARAMEL DRIZZLE: \nIngredients:  Corn Syrup, Sweetened Condensed Milk (Milk, Sugar) High Fructose Corn Syrup, Water, Butter, Sugar, Salt, Pectin, Disodium Phosphate, Artificial\nFlavors (Vanillin, Ethyl Vanillin), Caramel Color (with Sulfites), Potassium Sorbate (Preservative). \nCONTAINS: MILK. \nCARAMEL SYRUP: \nIngredients: Sugar, Water, Fructose, Natural (Plant Source) and Artificial Flavor, Salt, Caramel Color (with Sulfites), Potassium Sorbate (Preservative), Citric Acid,\nMalic Acid.\nCHOCOLATE CARAMEL SYRUP: \nIngredients:  Sugar, Water, Fructose, Natural (Plant Source) and Artificial Flavors, Chocolate Liquor, Caramel Color, (With Sulfites), Salt, Sucralose, Gellan Gum,\nPotassium Sorbate (Preservative), Citric Acid, Malic Acid, Red 40.\nCHOCOLATE CHIPS: \nIngredients:  Semi-Sweet Chocolate (Sugar, Chocolate, Cocoa Butter, Milkfat, Soy Lecithin, Vanillin [Artificial Flavor], Milk). \nCONTAINS: MILK, SOY LECITHIN. \nCHOCOLATE DRIZZLE: \nIngredients: Corn Syrup, Dextrose, Water, Sugar, Glycerin, Hydrogenated Coconut Oil, Cocoa (Processed with Alkali), Modified Food Starch, Nonfat Milk, Natural\n(Plant Source) and Artificial Flavor, Salt, Gellan Gum, Disodium Phosphate, Potassium Sorbate (Preservative), Soy Lecithin, Artificial Flavor (Vanillin). \nCONTAINS: MILK, SOY LECITHIN. \nCHOCOLATE SHAKE SYRUP: \nIngredients:  High Fructose Corn Syrup, Corn Syrup, Water, Cocoa (Processed with Alkali), Natural (Plant Source) and Artificial Flavors, Caramel Color, Salt,\nPotassium Sorbate (Preservative), Artificial Flavor (Vanillin), Red 40.\nMay contain small amounts of other shake flavors served at the restaurant, including egg ingredients when Egg Nog Shakes are available.\n \n \nCHOCOLATE SYRUP: \nIngredients: Sugar, Water, Natural (Plant Source) and Artificial Flavors, Chocolate Liquor, Caramel Color (with Sulfites), Vanilla Extract, Salt, Gellan Gum, Citric Acid,\nPotassium Sorbate (Preservative), Red 40.\nCOFFEE (Large): \nIngredients: Brewed Coffee\nCOFFEE (Medium): \nIngredients: Brewed Coffee\nCOFFEE (Small): \nIngredients: Brewed Coffee\nEGG NOG SHAKE SYRUP: \nIngredients: Corn Syrup, High Fructose Corn Syrup, Water, Sugar, Gum Arabic, Natural (Plant Source) and Artificial Flavor, Xanthan Gum, Sodium Benzoate\n(Preservative), Egg Yolks, Citric Acid, Salt, Yellow 5, Yellow 6, Red 40. \nCONTAINS: EGG. \nESPRESSO:\nFRENCH VANILLA SYRUP: \nIngredients: Sugar, Water, Natural (Plant Source) and Artificial Flavor, Potassium Sorbate and Sodium Benzoate (Preservatives), Citric Acid, Caramel Color (with\nSulfites).\nHAZELNUT SYRUP: \nIngredients:  Sugar, Water, Fructose, Natural (Plant Source) and Artificial Flavors, Potassium Sorbate (Preservative), Citric Acid, Caramel Color (with Sulfites), Malic\nAcid.\nICE: \nIngredients: ICE\nLIGHT CREAM: \nIngredients: Milk, Cream, Sodium Phosphate, DATEM, Sodium Stearoyl Lactylate, Sodium Citrate, Carrageenan. \nCONTAINS: MILK. \nLIQUID SUGAR: \nIngredients:  Sugar, Water, Potassium Sorbate (Preservative), Citric Acid.\nLOWFAT SMOOTHIE YOGURT: \nCultured Grade A Reduced Fat Milk, Sugar, Whey Protein Concentrate, Fructose, Corn Starch, Modified Food Starch, Gelatin.  Contains Active Yogurt Cultures. \nCONTAINS: MILK. \nMANGO PINEAPPLE FRUIT BASE: \nIngredients: Water, Clarified Demineralized Pineapple Juice Concentrate, Mango Puree Concentrate, Pineapple Juice Concentrate, Orange Juice Concentrate,\nPineapple Puree, Passion Fruit Juice, Apple Juice Concentrate, Natural (Botanical Source) and Artificial Flavors, Contains less than 1% of the following: Peach\nPuree, Cellulose Powder, Pear Juice Concentrate, Xanthan Gum, Peach Juice Concentrate, Pectin, Citric Acid, Colored with Fruit and Vegetable Juice and Turmeric\nExtract, Ascorbic Acid (Preservative). \nCONTAINS: MILK. \n*Dispensed from equipment that also dispenses milk ingredients (yogurt).\nMARASCHINO CHERRY: \nIngredients: Cherries, Water, Corn Syrup, High Fructose Corn Syrup, Sugar, Malic Acid, Citric Acid, Natural (Plant Source) and Artificial Flavors, Sodium Benzoate\nand Potassium Sorbate (Preservatives), Red 40, Sulfur Dioxide as Preservative (Contains Sulfites).\nMOCHA COFFEE FRAPPE BASE: \nIngredients:  Water, Cream, Sugar, Milk, High Fructose Corn Syrup, Coffee Extract, Natural (Plant Source) and Artificial Flavors, Cocoa (Processed with Alkali), Mono\nand Diglycerides, Guar Gum, Potassium Citrate, Disodium Phosphate, Carrageenan, Carob Bean Gum, Colored with Red 40, Yellow 5, Blue 1. \nCONTAINS: MILK. \nNONFAT MILK: \nIngredients: Nonfat Milk, Vitamin A Palmitate, Vitamin D3 Added. \nCONTAINS: MILK. \nPREMIUM ROAST COFFEE:\nSTRAWBERRY BANANA FRUIT BASE: \nIngredients: Strawberry Puree, Banana Puree, Water, Grape Juice Concentrate, Clarified Demineralized Pineapple Juice Concentrate, Sugar, Contains Less Than\n1%: Natural (Plant Source) and Artificial Flavors, Cellulose Powder, Pear Juice Concentrate, Peach Juice Concentrate, Xanthan Gum, Citric Acid, Pectin, Colored\nwith Fruit and Vegetable Juice, Ascorbic Acid (Preservative). \nCONTAINS: MILK. \n*Dispensed from equipment that also dispenses milk ingredients (yogurt)\nSTRAWBERRY SHAKE SYRUP: \nIngredients: Sugar, Water, Corn Syrup, Strawberries, High Fructose Corn Syrup, Natural (Botanical Source) and Artificial Flavor, Pectin, Citric Acid, Potassium\nSorbate (Preservative), Caramel Color, Calcium Chloride, Red 40.\nMay contain small amounts of other shake flavors served at the restaurant, including egg ingredients when Egg Nog Shakes are available.\nSUGAR FREE FRENCH VANILLA SYRUP: \nIngredients: Water, Eythritol, Natural (Plant Source) and Artificial Flavor, Cellulose Gum, Salt, Malic Acid, Potassium Sorbate (Preservative), Acesulfame Potassium,\nSucralose, Caramel Color.\nVANILLA REDUCED FAT ICE CREAM: \nIngredients:  Milk, Sugar, Cream, Nonfat Milk Solids, Corn Syrup Solids, Mono- and Diglycerides, Guar Gum, Dextrose, Sodium Citrate, Artificial Vanilla Flavor,\nSodium Phosphate, Carrageenan, Disodium Phosphate, Cellulose Gum, Vitamin A Palmitate. \nCONTAINS: MILK. \nVANILLA SHAKE SYRUP: \nIngredients: Corn Syrup, Water, Vanilla Extract, Caramel Color, Citric Acid, Pectin, Potassium Sorbate (Preservative), Yellow 5, Yellow 6.\n \nMay contain small amounts of other shake flavors served at the restaurant, including egg ingredients when Egg Nog Shakes are available.\nWHIPPED CREAM: \nIngredients:  Cream, Nonfat Milk, Corn Syrup, Sugar, High Fructose Corn Syrup, Contains Less Than 1%:  Mono-And Diglycerides, Carrageenan, Polysorbate 80,\nBeta Carotene (Color), Natural (Dairy and Plant Sources) and Artificial Flavor, Mixed Tocopherols (Vitamin E) to Protect Flavor.  Whipping Propellant (Nitrous Oxide). \nCONTAINS: MILK. \nWHOLE MILK: \nIngredients: Milk, Vitamin D3 Added. \nCONTAINS: MILK. \nDesserts/Shakes\nVanilla Reduced Fat Ice Cream Cone: \nVANILLA REDUCED FAT ICE CREAM, ICE CREAM CONE\nKiddie Cone: \nVANILLA REDUCED FAT ICE CREAM, ICE CREAM CONE\nHot Fudge Sundae: \nVANILLA REDUCED FAT ICE CREAM, HOT FUDGE TOPPING\nHot Caramel Sundae: \nVANILLA REDUCED FAT ICE CREAM, HOT CARAMEL TOPPING\nStrawberry Sundae: \nVANILLA REDUCED FAT ICE CREAM, STRAWBERRY TOPPING\nMcFlurry® with M&M'S® Candies: \nVANILLA REDUCED FAT ICE CREAM, M&M MINI MILK CHOCOLATE CANDIES\nMcFlurry® with OREO® Cookies: \nVANILLA REDUCED FAT ICE CREAM, OREO COOKIE PIECES\nPralines & Cream McFlurry (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, HOT CARAMEL TOPPING, PRALINE PECAN PIECES\nVanilla McCafé Shake (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, VANILLA SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nChocolate McCafé Shake (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, CHOCOLATE SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nStrawberry McCafé Shake (12 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, STRAWBERRY SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nBaked Hot Apple Pie: \nApples, enriched flour (bleached wheat flour, malted barley flour, niacin, reduced iron, thiamin mononitrate, riboflavin, folic acid), water, shortening [palm oil, soy\nlecithin, artificial flavor, beta carotene (color)], sugar, high fructose corn syrup, contains 2% or less of the following: food starch-modified, sorbitol, dextrose, brown\nsugar, sodium alginate, sodium citrate, sodium phosphate, dicalcium phosphate, yeast, salt, dehydrated apple powder, natural (plant source) and artificial flavors,\nnutmeg, preservatives (may contain one of more of the following: ascorbic acid, citric acid, erythorbic acid), enzymes, hydroxylated soy lecithin, L-cysteine (dough\nconditioner), annatto and turmeric (color), caramel color. Topping: [cinnamon sugar (sugar, cinnamon)]. \nCONTAINS: WHEAT AND SOY LECITHIN.\nBaked Pumpkin Pie†: \nIngredients: Milk, Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Ferrous Sulfate, Thiamine Mononitrate, Riboflavin, Folic Acid), Vegetable\nShortening (Palm Oil, Soy Lecithin, Artificial Flavor, and Beta Carotene [Color]), Pumpkin, High Fructose Corn Syrup, Sugar, Brown Sugar, Modified Food Starch,\nContains 2% or less of:  Cinnamon Sugar Topping (Sugar, Cinnamon), Yeast, Salt, Spices, Dextrose, Cellulose, Potassium Sorbate (Preservative), Cream of Tartar,\nNatural and Artificial Flavors (Plant Source), Annatto & Turmeric (Color), Hydroxylated Soy Lecithin, Enzyme, L-Cysteine (Dough Conditioner). \nCONTAINS: WHEAT, MILK AND SOY.\nBaked Sweet Potato Pie†: \nIngredients: Sweet Potatoes, Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid),\nShortening (Palm Oil, Palm Kernel Oil, Soy Lecithin, Artificial Flavor, Beta Carotene [Color]), Water, Brown Sugar, Evaporated Milk, Sugar, Modified Food Starch,\nContains 2% or Less of: Sugar, Molasses, Yeast, Salt, Potassium Sorbate, Spices, Sodium Alginate, Sodium Phosphate, Cream of Tartar, Calcium Sulfate,\nHydroxylated Soy Lecithin,   L-Cysteine (Dough Conditioner). \nCONTAINS: WHEAT, MILK AND SOY LECITHIN.\nChocolate Chip Cookie: \nSemi-sweet chocolate chips [sugar, chocolate liquor, cocoa butter, milkfat, soy lecithin (emulsifier), artificial flavor, vanilla], enriched flour (bleached wheat flour,\nmalted barley flour, niacin, iron, thiamin mononitrate, riboflavin, folic acid), margarine [palm oil, water, soybean oil, salt, natural flavor, whey, mono- and diglycerides,\nsodium benzoate (preservative), soy lecithin, beta carotene (color), natural flavor (dairy source), artificial flavor, vitamin A palmitate], sugar, brown sugar, eggs,\nartificial flavor (vanillin, ethyl vanillin), caramel color, leavening (baking soda, sodium acid pyrophosphate, corn starch, monocalcium phosphate), salt. \nCONTAINS: WHEAT, MILK, EGG AND SOY LECITHIN.\nOatmeal Raisin Cookie: \nEnriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Sugar, Margarine (Palm Oil, Water, Soybean\nOil, Salt, Whey, Mono and Diglycerides, Soy Lecithin, Sodium Benzoate [Preservative], Beta Carotene [Color], Natural [Dairy Source] and/or Artificial Flavors, Vitamin\nA Palmitate), Rolled Oats, Brown Sugar, Raisins, Eggs, Corn Flakes (Milled Corn, Sugar, Malt Flavoring, Salt, Reduced Iron, Riboflavin [Vitamin B2], Thiamin\nHydrochloride [Vitamin B1], Calcium Pantothenate, Pyridoxine Hydrochloride [Vitamin B6], Folic Acid), Sweetened Coconut (Desiccated Coconut, Sugar, Water,\nPropylene Glycol, Sodium Metabisulfite Added to Preserve Color [Contains Sulfites]), Leavening (Baking Soda, Sodium Acid Pyrophosphate, Corn Starch,\nMonocalcium Phosphate), Artificial Flavor (Vanillin), Caramel Color, Salt. \nCONTAINS: WHEAT, MILK, EGG, TREE NUTS (COCONUT) AND SOY LECITHIN.\nFruit 'n Yogurt Parfait: \nLOWFAT YOGURT (for Parfaits), STRAWBERRIES, BLUEBERRIES (for Parfait), LOW FAT CRUNCHY GRANOLA\nChocolate McCafé Shake (16 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, CHOCOLATE SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nChocolate McCafé Shake (22 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, CHOCOLATE SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nSnack Size McFlurry® with Rolo®†: \nVANILLA REDUCED FAT ICE CREAM, HOT CARAMEL TOPPING, ROLO CHOPPED SHELLS (TOPPING)\nStrawberry McCafé Shake (16 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, STRAWBERRY SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nStrawberry McCafé Shake (22 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, STRAWBERRY SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nVanilla McCafé Shake (16 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, VANILLA SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nVanilla McCafé Shake (22 fl oz cup): \nVANILLA REDUCED FAT ICE CREAM, VANILLA SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nEgg Nog McCafe Shake (16 fl oz cup) Medium†: \nVANILLA REDUCED FAT ICE CREAM, EGG NOG SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nEgg Nog McCafe Shake (22 fl oz cup) Large†: \nVANILLA REDUCED FAT ICE CREAM, EGG NOG SHAKE SYRUP, WHIPPED CREAM, MARASCHINO CHERRY\nMcFlurry® with Reese's Peanut Butter Cup® (16 fl oz cup)†: \nVANILLA REDUCED FAT ICE CREAM, REESE'S PEANUT BUTTER CUP CANDY PIECES\nSnack Size Holiday Mint McFlurry®†: \nVANILLA REDUCED FAT ICE CREAM, PEPPERMINT CANDY TOPPING, HOLIDAY MINT FLAVORED MCFLURRY SYRUP\nSnack Size McFlurry® with Reese's Peanut Butter Cup® †: \nVANILLA REDUCED FAT ICE CREAM, REESE'S PEANUT BUTTER CUP CANDY PIECES\nBLUEBERRIES (for Parfait): \nBlueberries\nCHOCOLATE SHAKE SYRUP: \nIngredients:  High Fructose Corn Syrup, Corn Syrup, Water, Cocoa (Processed with Alkali), Natural (Plant Source) and Artificial Flavors, Caramel Color, Salt,\nPotassium Sorbate (Preservative), Artificial Flavor (Vanillin), Red 40.\nMay contain small amounts of other shake flavors served at the restaurant, including egg ingredients when Egg Nog Shakes are available.\n \n \nEGG NOG SHAKE SYRUP: \nIngredients: Corn Syrup, High Fructose Corn Syrup, Water, Sugar, Gum Arabic, Natural (Plant Source) and Artificial Flavor, Xanthan Gum, Sodium Benzoate\n(Preservative), Egg Yolks, Citric Acid, Salt, Yellow 5, Yellow 6, Red 40. \nCONTAINS: EGG. \nHOLIDAY MINT FLAVORED MCFLURRY SYRUP: \nIngredients: Corn Syrup, Water, Sugar, Natural (Dairy and Plant Sources) and Artificial Flavors, Citric Acid, Xanthan Gum, Sodium Benzoate (Preservative), Caramel\nColor. \nCONTAINS: MILK. \nHOT CARAMEL TOPPING: \nIngredients:  Corn Syrup, Sweetened Condensed Milk (Milk, Sugar), High Fructose Corn Syrup, Butter (Cream, Salt), Sugar, Water, Disodium Phosphate, Pectin,\nSalt, Potassium Sorbate (Preservative), Artificial Flavors (Vanillin, Ethyl Vanillin). \nCONTAINS: MILK. \nHOT FUDGE TOPPING: \nIngredients:  Sugar, Water, Sweetened Condensed Skim Milk (Milk, Sugar), Partially Hydrogenated Palm Kernel Oil and/or Hydrogenated Palm Kernel Oil, Nonfat Dry\nMilk, Cocoa (Processed with Alkali), Corn Syrup, Salt, Disodium Phosphate, Potassium Sorbate (Preservative), Artificial Flavor (Vanillin), Soy Lecithin, Polyglycerol\nEsters of Fatty Acids. \nCONTAINS: MILK AND SOY LECITHIN. \nICE CREAM CONE: \nIngredients: Enriched Flour (Wheat Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Tapioca Starch, Sugar, Shortening (Soybean Oil, Palm\nOil, Soy Lecithin [Emulsifier]), Leavening (Baking Soda, Ammonium Bicarbonate), Salt, Natural Flavor (Plant Source), Annatto (Color), Caramel Color, Corn Syrup\n(Processing Aid). \nCONTAINS: WHEAT, SOY LECITHIN. \nLOW FAT CRUNCHY GRANOLA: \nIngredients: Whole Grain Rolled Oats, Brown Sugar, Crisp Rice (Rice Flour, Barley Malt Extract, Salt), Sunflower Oil, Salt, Baking Soda, Citric Acid, Crushed\nOranges, Cinnamon, Natural Flavor (Vegetable Source).\nMAY CONTAIN SOY AND WHEAT.\nLOWFAT YOGURT (for Parfaits): \nIngredients:  Cultured Pasteurized Grade A Reduced Fat Milk, Sugar, Modified Food Starch, Fructose, Whey Protein Concentrate, Corn Starch, Gelatin, Natural\n(Plant Source) and Artificial Flavor, Potassium Sorbate (Added to Maintain Freshness). \nCONTAINS: MILK. \nM&M MINI MILK CHOCOLATE CANDIES: \nIngredients: Milk Chocolate (Sugar, Chocolate, Skim Milk, Cocoa Butter, Lactose, Milkfat, Soy Lecithin, Salt, Artificial Flavors), Sugar, Contains 2% Or Less: Corn\nStarch, Corn Syrup, Colored with (Yellow 5 Lake, Red 40 Lake, Blue 1 Lake, Yellow 6 Lake, Blue 2 Lake, Yellow 5, Red 40, Blue 1, Yellow 6, Blue 2), Dextrin.\nCONTAINS MILK, SOY LECITHIN.\nM&M® CANDIES MAY CONTAIN PEANUTS\nMARASCHINO CHERRY: \nIngredients: Cherries, Water, Corn Syrup, High Fructose Corn Syrup, Sugar, Malic Acid, Citric Acid, Natural (Plant Source) and Artificial Flavors, Sodium Benzoate\nand Potassium Sorbate (Preservatives), Red 40, Sulfur Dioxide as Preservative (Contains Sulfites).\nOREO COOKIE PIECES: \nIngredients: Sugar, Enriched Flour (Wheat Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Vegetable Oil (May contain one or more of the\nfollowing: High Oleic Canola Oil, Palm Oil, Canola Oil and/or Soybean Oil), Cocoa (Processed with Alkali), High Fructose Corn Syrup, Corn Starch, Leavening\n(Baking Soda, Calcium Phosphate), Salt, Soy Lecithin (Emulsifier), Artificial Flavor (Vanillin), Chocolate. \nCONTAINS: WHEAT , SOY LECITHIN. \nPEPPERMINT CANDY TOPPING: \nIngredients: Sugar, Fractionated Palm Kernel Oil, Nonfat Milk, Corn Syrup, Corn Cereal, Modified Food Starch, Partially Hydrogenated Soybean Oil, Degerminated\nYellow Corn Meal, Soy Lecithin, Red 40 Lake, Natural Flavor (Botanical Source), Yellow 5 Lake, Salt, Blue 1 Lake, Turmeric Extract (Color), Red 40, Blue 1. \nCONTAINS: MILK AND SOY LECITHIN. \nMANUFACTURED ON EQUIPMENT THAT PROCESSES PEANUTS AND TREE NUTS\nPRALINE PECAN PIECES: \nIngredients:  Pecans, Sugar, Butter, Salt, Soy Lecithin, Peanut Oil and/or Cottonseed Oil, Caramel Color. \nCONTAINS: PECANS, MILK, SOY LECITHIN. \nMAY CONTAIN SHELL PARTS, PEANUTS AND OTHER TREE NUTS.\nREESE'S PEANUT BUTTER CUP CANDY PIECES: \nIngredients: Milk Chocolate (Sugar, Cocoa Butter, Chocolate, Nonfat Milk, Milkfat, Lactose, Soy Lecithin and PGPR [Emulsifier]), Peanuts, Sugar, Dextrose,\nChocolate, Nonfat Milk, Contains 2% Or Less:  Tapioca Maltodextrin, Salt, Vegetable Oil (Cocoa Butter, Palm, Shea, Sunflower and/or Safflower Oil), Whey, Milkfat,\nSoy Lecithin, TBHQ (Preservative), Artificial Flavor (Vanillin). \nCONTAINS: MILK, PEANUTS, SOY LECITHIN. \nROLO CHOPPED SHELLS (TOPPING): \nIngredients:  Milk Chocolate (Sugar, Nonfat Milk, Cocoa Butter, Chocolate, Lactose, Milkfat, Soy Lecithin, PGRP [Emulsifier]), Vanillin, Artificial Flavor). \nCONTAINS: MILK, SOY LECITHIN. \nMANUFACTURED ON EQUIPMENT THAT PROCESSES ALMONDS\nSTRAWBERRIES: \nIngredients: Strawberries, Konjac Flour.\nSTRAWBERRY SHAKE SYRUP: \nIngredients: Sugar, Water, Corn Syrup, Strawberries, High Fructose Corn Syrup, Natural (Botanical Source) and Artificial Flavor, Pectin, Citric Acid, Potassium\nSorbate (Preservative), Caramel Color, Calcium Chloride, Red 40.\nMay contain small amounts of other shake flavors served at the restaurant, including egg ingredients when Egg Nog Shakes are available.\nSTRAWBERRY TOPPING: \nIngredients:  Strawberries, Sugar, Water, High Fructose Corn Syrup, Natural Strawberry Flavor with other Natural Flavors (Fruit Source), Citric Acid, Pectin, Sodium\nBenzoate (Preservative), Carob Bean Gum, Red 40, Calcium Chloride.\nVANILLA REDUCED FAT ICE CREAM: \nIngredients:  Milk, Sugar, Cream, Nonfat Milk Solids, Corn Syrup Solids, Mono- and Diglycerides, Guar Gum, Dextrose, Sodium Citrate, Artificial Vanilla Flavor,\nSodium Phosphate, Carrageenan, Disodium Phosphate, Cellulose Gum, Vitamin A Palmitate. \nCONTAINS: MILK. \nVANILLA SHAKE SYRUP: \nIngredients: Corn Syrup, Water, Vanilla Extract, Caramel Color, Citric Acid, Pectin, Potassium Sorbate (Preservative), Yellow 5, Yellow 6.\n \nMay contain small amounts of other shake flavors served at the restaurant, including egg ingredients when Egg Nog Shakes are available.\nWHIPPED CREAM: \nIngredients:  Cream, Nonfat Milk, Corn Syrup, Sugar, High Fructose Corn Syrup, Contains Less Than 1%:  Mono-And Diglycerides, Carrageenan, Polysorbate 80,\nBeta Carotene (Color), Natural (Dairy and Plant Sources) and Artificial Flavor, Mixed Tocopherols (Vitamin E) to Protect Flavor.  Whipping Propellant (Nitrous Oxide). \nCONTAINS: MILK. \nCondiments\nNewman's Own® Creamy Southwest Dressing: \nWater, corn syrup solids, soybean oil, distilled vinegar, egg yolks, corn vinegar, corn starch, whey, salt, cilantro, sugar, spices, onion powder, garlic powder, apple\ncider vinegar, sour cream powder (cultured sour cream, skim milk solids, whey, sugar, citric acid, lactic acid), natural flavors (animal and vegetable source), xanthan\ngum, lactic acid, paprika, parsley. \nCONTAINS: EGG AND MILK.\nNewman's Own® Low Fat Balsamic Vinaigrette: \nWater, balsamic vinegar [wine vinegar, grape must, caramel color, sulfur dioxide to protect flavor (contains sulfites)], sugar, soybean oil, distilled vinegar, olive oil, sea\nsalt, garlic juice, salt, spices, xanthan gum, onion, red bell pepper flakes, dried green onion, parsley, oleoresin paprika (color).\nKetchup Packet: \nTomato concentrate from red ripe tomatoes, distilled vinegar, high fructose corn syrup, corn syrup, water, salt, natural flavors (vegetable source).\nNewman's Own® Low Fat Family Recipe Italian Dressing: \nWater, corn syrup solids, distilled vinegar, Romano cheese (pasteurized milk, cheese cultures, salt, enzymes), soybean oil, sea salt, sugar, worcestershire sauce\n[distilled vinegar, molasses, corn syrup, water, salt, caramel color, garlic powder, sugar, spices, tamarind, natural flavor (fruit source)], anchovy paste (cured\nanchovies, salt, water), dried onion, dried garlic, spices, xanthan gum, barley malt extract (contains barley gluten), citric acid, paprika (color), hydrolyzed soy protein. \nCONTAINS: MILK, SOY AND FISH (ANCHOVY).\nSalt Packet: \nTable salt.\nTangy Barbeque Sauce: \nHigh fructose corn syrup, water, tomato paste, grape vinegar, distilled vinegar, salt, soy sauce (water, wheat, soybeans, salt), food starch-modified, spices, dextrose,\nsoybean oil, natural smoke flavor (plant source), xanthan gum, caramel color, garlic powder, cellulose gum, dried chili peppers, malic acid, natural flavor (fruit and\nvegetable source), onion powder, sodium benzoate (preservative), succinic acid. \nCONTAINS: WHEAT AND SOY.\nHoney : \nGrade A pure honey.\nNewman's Own® Ranch Dressing: \nWater, soybean oil, corn syrup solids, buttermilk, distilled vinegar, egg yolks, salt, sugar, corn starch, chives, garlic powder, onion powder, natural flavors (dairy and\nanimal source), lactic acid, parsley, xanthan gum, lemon juice concentrate. \nCONTAINS: MILK AND EGG.\nHot Mustard Sauce: \nWater, high fructose corn syrup, distilled vinegar, soybean oil, mustard seed, salt, spices, egg yolks, food starch-modified, turmeric, xanthan gum, annatto extract,\nsodium benzoate (preservative), caramel color, calcium disodium EDTA (protect flavor), spice extractives, paprika. \nCONTAINS: EGG.\nSweet 'N Sour Sauce: \nHigh fructose corn syrup, water, apricot puree concentrate and/or peach puree concentrate, distilled vinegar, soy sauce (water, wheat, soybeans, salt), salt, food\nstarch-modified, dextrose, soybean oil, xanthan gum, spices, sodium benzoate (preservative), natural flavors (fruit, vegetable and plant source), garlic powder,\ncellulose gum, dried chili peppers, malic acid, onion powder, caramel color, extractives of paprika, succinic acid. \nCONTAINS: WHEAT AND SOY.\nPeanuts (for Sundaes): \nPeanuts, dry roasted. \nCONTAINS: PEANUTS. \nMAY CONTAIN TREE NUTS.\nSpicy Buffalo Sauce: \nCayenne pepper sauce (cayenne red peppers, vinegar, salt, garlic), water, soybean oil, food starch-modified, xanthan gum, beet juice (color), natural flavor (dairy and\nvegetable source), garlic, citric acid, calcium disodium EDTA (protect flavor). \nCONTAINS: MILK.\nCreamy Ranch Sauce: \nSoybean oil, water, cultured lowfat buttermilk, distilled vinegar, sugar, egg yolks, sea salt, garlic juice, xanthan gum, salt, lactic acid, spices, modified guar gum, onion\npowder, natural flavor (botanical source), potassium sorbate (preservative), autolyzed torula yeast extract, parsley, calcium disodium EDTA (protect flavor). \nCONTAINS: EGG AND MILK.\nHoney Mustard Sauce: \nWater, sugar, soybean oil, dijon mustard (distilled vinegar, mustard seed, salt, water, white wine, spices), mustard (water, distilled vinegar, mustard seed, salt,\nturmeric, paprika), honey, corn syrup solids, distilled vinegar, egg yolks, cellulose gel, xanthan gum, salt, cellulose gum, sodium benzoate (preservative), autolyzed\ntorula yeast extract, spice, natural (animal and botanical source) and artificial flavor, oleoresin turmeric (color). \nCONTAINS: EGG.\nChipotle Barbeque Sauce: \nHigh fructose corn syrup, water, tomato paste, honey, distilled vinegar, molasses, food starch-modified, salt, dried chipotle peppers, natural smoke flavor (plant\nsource), dried chili peppers, soybean oil, onion powder, sodium benzoate and potassium sorbate (preservatives), garlic powder, propylene glycol alginate, caramel\ncolor, spice.\nHotcake Syrup: \nCorn syrup, sugar, water, artificial maple flavor, potassium sorbate as a preservative, caramel color.\nWhipped Margarine (1 pat): \nSoybean oil, palm oil, palm kernel oil, partially hydrogenated soybean oil, whey, salt, hydrogenated cottonseed oil, vegetable mono- and diglycerides and soy lecithin\n(emulsifiers), sodium benzoate and potassium sorbate (preservatives), artificial flavor, vitamin A palmitate, beta carotene (color). \nCONTAINS: MILK AND SOY LECITHIN.\nGrape Jam: \nConcord grape puree, corn syrup, sugar, grape juice concentrate, fruit pectin, malic acid, sodium citrate.\nCoffee Cream: \nMilk, cream, sodium phosphate, datem, sodium stearoyl lactylate, sodium citrate, carrageenan. \nCONTAINS: MILK.\nStrawberry Preserves: \nSugar, strawberries, strawberry puree concentrate, fruit pectin, citric acid, sodium citrate.\nSugar Packet: \nWhite granulated sugar.\nEQUAL® 0 Calorie Sweetener: \nDextrose with maltodextrin, aspartame. PHENYLKETONURICS: ASPARTAME CONTAINS PHENYLALANINE\nSPLENDA® No Calorie Sweetener: \nDextrose, maltodextrin, sucralose.\nBuffalo Ranch McChicken: \nMCCHICKEN PATTY, REGULAR BUN, SHREDDED LETTUCE, SPICY BUFFALO SAUCE, BUTTERMILK RANCH SAUCE\nHot Habanero Sauce†: \nSoybean oil, water, corn syrup solids, distilled vinegar, buttermilk powder, egg yolks, maltodextrin, cayenne red peppers, sugar, food starch-modified, salt, onion\npowder, garlic powder, spice and spice extractives, natural flavor (dairy and animal source), lemon juice concentrate, lactic acid, habanero pepper, red bell pepper\npowder, ground chili pepper, sodium benzoate and potassium sorbate (preservatives), xanthan gum, propylene glycol alginate, apple cider vinegar. \nCONTAINS: MILK AND EGG.\nNewman's Own® Low Fat Sesame Ginger Dressing: \nWater, soy sauce (soybeans, wheat, salt), sugar, corn syrup solids, distilled vinegar, soybean oil, freeze dried orange juice concentrate, roasted sesame seed oil,\ncorn starch, guajillo pepper, ginger, dehydrated onion, corn vinegar, dehydrated garlic, dehydrated bell pepper, brown sugar, garlic, salt, parsley, xanthan gum, apple\ncider vinegar, spices, citric acid, sea salt, caramel color, maltodextrin. \nCONTAINS: WHEAT AND SOY.\nPremium McWrap Southwest Chicken (Grilled): \nGRILLED CHICKEN FILLET, FLOUR TORTILLA, TOMATO SLICE, SHREDDED LETTUCE, CILANTRO LIME GLAZE, HABANERO RANCH SAUCE, SHREDDED\nCHEDDAR/JACK CHEESE, SPRING MIX, CHILI LIME TORTILLA STRIPS\nSweet Chili Sauce†: \nWater, sugar, distilled vinegar, cayenne peppers, food starch-modified, salt, garlic puree, dried red peppers, sodium benzoate (preservative).\nTartar Sauce Cup: \nSoybean Oil, Dill Relish (Diced Pickles, Water, Salt, Vinegar, Capers, Xanthan Gum, Calcium Chloride, Potassium Sorbate [Preservative], Spice Extracts With\nPolysorbate 80), Water, Egg Yolks, Distilled Vinegar, Contains 1% or Less: Sugar, Salt, Mustard Flour, Sodium Benzoate and Potassium Sorbate (Preservatives),\nXanthan Gum, Natural Flavor (Botanical Source), Sea Salt, Calcium Disodium EDTA (to protect flavor). \nCONTAINS: EGG.\nBUTTERMILK RANCH SAUCE: \nIngredients:  Soybean Oil, Cultured Buttermilk, Water, Sour Cream (Milk, Cultured Cream, Modified Food Starch, Guar Gum, Sodium Phosphates, Carob Bean Gum,\nSodium Citrate, Calcium Sulfate, Carrageenan, Dextrose, Potassium Sorbate, Citric Acid, Gelatin, Mono- and Diglycerides), Egg Yolks, Contains 2% or Less: Distilled\nVinegar, Maltodextrin, Salt, Dextrose, Modified Food Starch, Soy Sauce (Soybeans, Wheat, Salt), Dried Onion, Garlic Powder, Lactic Acid, Natural (Plant and Dairy\nSources) and Artificial Flavors, Shallots, Preservatives (Sodium Benzoate, Potassium Sorbate, Calcium Disodium EDTA), Xanthan Gum, Spice, Phosphoric Acid,\nSodium Acid Sulfate, Propylene Glycol Alginate, Autolyzed Yeast Extract. \nCONTAINS: MILK, EGG, SOY, WHEAT. \nCHILI LIME TORTILLA STRIPS: \nIngredients:  Corn, Vegetable Oil (Corn, Soybean and Sunflower Oil), Salt, Maltodextrin, Sugar, Dried Tomato, Dextrose, Spices, Onion Powder, Green Bell Pepper\nPowder, Citric Acid, Autolyzed Yeast Extract, Malic Acid, Paprika Extract (Color), Disodium Inosinate, Disodium Guanylate, Natural Flavor (Plant Source), Lemon\nExtract, Spice Extractive.\nCILANTRO LIME GLAZE: \nIngredients: Water, Corn Syrup Solids, High Fructose Corn Syrup, Sugar, Distilled Vinegar, Olive Oil, Soybean Oil, Freeze-Dried Orange Juice Concentrate, Cilantro,\nSalt, Freeze-Dried Lime Juice Concentrate, Xanthan Gum, Sodium Benzoate and Potassium Sorbate (Preservatives), Garlic Powder, Propylene Glycol Alginate,\nSpice, Onion Powder, Citric Acid.\nFLOUR TORTILLA: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, Shortening\n(Interesterified Soybean Oil and/or Hydrogenated Soybean Oil and/or Soybean Oil and/or Hydrogenated Cottonseed Oil), Contains 2% or Less of: Sugar, Leavening\n(May Contain One or More of: Baking Soda, Sodium Aluminum Sulfate, Corn Starch, Sodium Acid Pyrophosphate, Calcium Sulfate, Monocalcium Phosphate), Salt,\nWheat Gluten, Dough Conditioners (Sodium Metabisulfite [Contains Sulfites], Distilled Monoglycerides). \nCONTAINS: WHEAT. \nGRILLED CHICKEN FILLET: \nIngredients: Chicken Breast Fillet with Rib Meat, Water, Seasoning (Rice Starch, Salt, Sugar, Yeast Extract, Canola Oil, Onion Powder, Maltodextrin, Chicken Skin,\nPaprika, Flavor, Sunflower Oil, Chicken, Garlic Powder, Chicken Fat, Spices), Sodium Phosphates.\n \nPrepared with Liquid Margarine: Liquid Soybean Oil and Hydrogenated Cottonseed and Soybean Oils, Water, Partially Hydrogenated Soybean Oil, Salt, Soy Lecithin,\nMono-and Diglycerides, Sodium Benzoate and Potassium Sorbate (Preservatives), Artificial Flavor, Citric Acid, Vitamin A Palmitate, Beta Carotene (Color). \nCONTAINS: SOY LECITHIN\nPrepared with Liquid Margarine: Liquid soybean oil and hydrogenated cottonseed and soybean oils, water, partially hydrogenated soybean oil, salt, soy\nlecithin, mono-and diglycerides, sodium benzoate and potassium sorbate (preservatives), artificial flavor, citric acid, vitamin A palmitate, beta carotene\n(color). \n \nCONTAINS: SOY LECITHIN. \nHABANERO RANCH SAUCE: \nIngredients: Water, Soybean Oil, Corn Syrup Solids, Distilled Vinegar, Buttermilk Powder, Egg Yolks, Maltodextrin, Dried Cayenne Red Pepper Sauce (Aged\nCayenne Red Peppers, Vinegar, Salt, Garlic), Sugar, Corn Starch, Modified Food Starch, Contains 1% or Less:  Salt, Spice and Spice Extractives, Natural Flavor\n(Dairy and Animal Sources), Lemon Juice Concentrate, Lactic Acid, Habanero Pepper, Red Bell Pepper Powder, Sodium Benzoate and Potassium Sorbate\n(Preservatives), Xanthan Gum, Propylene Glycol Alginate, Apple Cider Vinegar. \nCONTAINS: MILK, EGG. \nMcChicken\u0000 Patty: \nIngredients:  Chicken, Water, Salt, Sodium Phosphates.  Battered and Breaded with:  Bleached Wheat Flour, Water, Wheat Flour, Modified Food Starch, Salt, Spices,\nWheat Gluten, Paprika, Dextrose, Yeast, Garlic Powder, Partially Hydrogenated Soybean Oil and Cottonseed Oil with Mono and Diglycerides, Leavening (Sodium\nAcid Pyrophosphate, Baking Soda, Ammonium Bicarbonate, Monocalcium Phosphate), Natural Flavor (Plant Source) with Extractives of Paprika. \nCONTAINS: WHEAT. \nPrepared in Vegetable Oil (Canola Oil, Corn Oil, Soybean Oil, Hydrogenated Soybean Oil with TBHQ and Citric Acid added to preserve freshness).\nDimethylpolysiloxane added as an antifoaming agent.\nREGULAR BUN: \nIngredients: Enriched Flour (Bleached Wheat Flour, Malted Barley Flour, Niacin, Reduced Iron, Thiamin Mononitrate, Riboflavin, Folic Acid), Water, High Fructose\nCorn Syrup and/or Sugar, Yeast, Soybean Oil and/or Canola Oil, Contains 2% or Less: Salt, Wheat Gluten, Calcium Sulfate, Calcium Carbonate, Ammonium Sulfate,\nAmmonium Chloride, Dough Conditioners (May Contain One or More of: Sodium Stearoyl Lactylate, DATEM, Ascorbic Acid, Azodicarbonamide, Mono and\nDiglycerides, Ethoxylated Monoglycerides, Monocalcium Phosphate, Enzymes, Guar Gum, Calcium Peroxide), Sorbic Acid, Calcium Propionate and/or Sodium\nPropionate (Preservatives), Soy Lecithin. \nCONTAINS: WHEAT, SOY LECITHIN. \nSHREDDED CHEDDAR/JACK CHEESE: \nIngredients: Cheddar Cheese (Pasteurized Milk, Cheese Culture, Salt, Enzymes, Annatto [Color]), Monterey Jack Cheese (Pasteurized Milk, Cheese Culture, Salt,\nEnzymes), Potato Starch and Corn Starch and Powdered Cellulose (Prevent Caking), Dextrose, Enzymes, Natamycin (Natural Mold Inhibitor). \nCONTAINS: MILK. \nSHREDDED LETTUCE:\nSPICY BUFFALO SAUCE: \nIngredients: Cayenne Pepper Sauce (Cayenne Red Peppers, Vinegar, Salt, Garlic), Water, Soybean Oil, Modified Food Starch, Xanthan Gum, Beet Juice (Color),\nNatural Flavor (Plant and Dairy Source), Garlic, Citric Acid, Calcium Disodium EDTA (Protect Flavor), Citric Acid. \nCONTAINS: MILK. \nSPRING MIX: \nIngredients: May contain some or all of the following Baby Whole Leaf Varieties: Baby Green Romaine, Baby Red Romaine, Baby Red Leaf, Baby Green Leaf, Baby\nRed Swiss Chard, Baby Red Oak, Baby Green Oak, Lolla Rosa, Tango, Tatsoi, Arugula, Mizuna, Frisee, Radicchio.\nTOMATO SLICE:\nThis list has been generated by McDonalds.com and is effective 11-08-2013.\n† Available at participating McDonald's\n+ Based on the weight before cooking 4 oz. (113.4g)\n++ Based on the weight before cooking 8 oz. (226.8g)\n+++ Based on the weight before cooking 5.33 oz. (151.1 g)\nThe nutrition information on this website is derived from testing conducted in accredited laboratories, published resources, or from information provided from McDonald's suppliers.  The nutrition information is based on\nstandard product formulations and serving sizes (including ice for beverages).  All nutrition information is based on average values for ingredients from McDonald's suppliers throughout the U.S. and is rounded to meet\ncurrent US FDA NLEA guidelines.  Variation in serving sizes, preparation techniques, product testing and sources of supply, as well as regional and seasonal differences may affect the nutrition values for each product.  In\naddition, product formulations change periodically.  You should expect some variation in the nutrient content of the products purchased in our restaurants.  None of our products is certified as vegetarian. This information is\ncorrect as of November 2013, unless stated otherwise.\nSPLENDA® No Calorie Sweetener is the registered trademark of McNeil Nutritionals, LLC\nEQUAL® 0 Calorie Sweetener is a registered trademark of Merisant Company\n\n",
    "uploaded_at": 1755334600.09179
  }
}